import tkinter as tk
from tkinter import ttk
import json
import time
import tkinter as tk
from tkinter import ttk
import pyautogui
import pandas as pd
import json
from DrissionPage import ChromiumPage, ChromiumOptions



cities_1st = [
    "أبو مريكة", "أبوحدرية", "أم الحمام", "أم السواد", "أم الشفلح السوريه", "أم العراد", "أم عشر الغربية", 
    "ابارالعشير", "ابرق الكبريت", "ابرقيه", "ابو طوطاحه البرازي", "ابوثور", "ابوخشبه", "ابوقميص", 
    "ابوكوله", "ابومعن", "ارامكو معمل الخرسانيه", "ارامكو معمل فرز", "استراحة ساسكو", "اسكان الكلابيه", 
    "اسكان وزارة الداخليه", "الاحساء", "الاحساء - الرفيعه", "الاوجام", "الباهيه", "البحث", "البستان", 
    "البطاليه", "البطحاء", "البويبيات", "التهيميه", "التوبى", "التويثير", "الثقبه", "الثمامه", "الثوير", 
    "الجابريه", "الجاروديه", "الجبيل", "الجبيل", "الجديدة على طريق ابو حدريه", "الجديده", "الجرن", 
    "الجش", "الجشه", "الجعيمه (قيادة حرس الحدود برأس تنورة)", "الجفر", "الجلادي", "الجويه", "الحاره", 
    "الحسى", "الحليله", "الحماطيات", "الحناه", "الحوطه", "الحويه (1)", "الحويه (2)", "الحويه (5،4،3)", 
    "الحويه الجديده", "الحيراء", "الخبر", "الخترشيه", "الخفجى", "الخوير", "الخويلديه", "الدالوه", 
    "الدريدى ومجموعه الدفاع الجوي", "الدغيميه", "الدماغيه", "الدمام", "الدهو", "الذيابيه", "الذيبيه", 
    "الراجحه", "الراجحية", "الرافعيه", "الرفاع", "الرقعى", "الرقعى الجديده", "الرميله", "الرويحه", 
    "الزايدية", "الزخنونيه (صلاصل الجديدة)", "الزغبيه", "الزغين", "الزغين", "الزور", "الساباط", 
    "السبائخ", "السديره", "السعيره", "السفانيه", "السلم", "السلمانية", "السلمانيه", "السيايره", 
    "الشاميه", "الشركة الشرقيه للتنمية الزراعية", "الشركه الشرقيه لتعدين الاملاح", "الشقيق", 
    "الشهارين", "الشيبه موقع عمل شركه ارامكو 1", "الشيحيه", "الشيط", "الصحاف", "الصداوى", "الصدريه", 
    "الصرار", "الصفيرى", "الصليبيه", "الطرف", "الطريبيل", "الظهران", "العاذرية", "العاذريه", "العاليه", 
    "العثمانيه", "العثمانيه (11)", "العثمانيه (13)", "العثمانيه (3)", "العثمانيه (5)", "العثمانيه (6)", 
    "العراميه", "العصلاء", "العضيليه", "العقار", "العقير", "العقير", "العمران", "العميرات", "العواميه", 
    "العوضيه", "العيون", "العيينه", "الغويبه", "الفالحيه", "الفاو الشمالى", "الفردانيه", "الفريده", 
    "الفضول", "الفهدة", "القاره", "القاسمه", "القديح", "القرعاء", "القرين", "القصار (مركز حدود ومجموعه صنادق)", 
    "القصب ( عطيه )", "القصب الشمالي", "القطار", "القطيف", "القلت", "القليب", "القيصومه", "الكداديه الشرقيه", 
    "الكداديه الغربيه", "الكفاح للخرسانة", "الكلابيه", "الكهفه", "اللصافه", "اللهابه", "المانعيه", 
    "المبرز", "المتياهه الجنوبيه", "المحمدية", "المحوى", "المراح", "المركز", "المركز السعودي لجسر الملك فهد", 
    "المزاوى", "المصيف", "المطيرفى", "المعيضيه", "المغره ومحطة العتل", "المقدام", "الملاحه", "المنصوره", 
    "المنصوريه", "المنيزله", "النابيه", "النايفيه", "النجبيه", "النصبيه", "النظيم", "النعيريه", "النقيره", 
    "الهزاع (الرئيسي)", "الهفوف", "الهليسيه", "الواضحه", "الوزيه", "الونان", "ام الحمام", "ام الساهك", 
    "ام الغربان", "ام القطا", "ام ربيعة", "ام ضليع", "ام عدوه", "ام عشر الشرقيه", "ام عقلاء", "ام غور", 
    "ام قليب", "ام كداد", "انباك", "انطاع", "انقير", "بئرالقلايب", "بخاء (مزرعه)", "بدع ام الحمام", 
    "بدع ام السواد", "بدع زميع", "بعيج", "بقيق", "بلده عين دار البلد عين دار القديمة", "بني معن", "بيان", 
    "تاروت", "تناقيب", "ثاج", "جحيظه", "جليجله", "جنه", "جنوب الصرار", "جوده", "جوسمين", "حرض", "حرض (1)", 
    "حرض (2)", "حرض29/10", "حفر الباطن", "حله محيش", "حنيذ", "حوية مغرزات 825", "حويه (16)", "خبيراء", 
    "خريص", "خشم الزينه", "خشم الزينه", "خلاطة اسفلت شركة اجزالا", "خور الذيابه", "خور بجران", "خور تعيب", 
    "دارين", "درب الابل", "دميغ", "ذاعبلوتن", "رأس تنورة", "راس مشعاب", "رزحان (مزرعه)", "رويلان", 
    "ساموده", "سحمه", "سكن شركة الاسمنت", "سكن محطة ضخ الماء للرياض رقم (4)", "سلطانه", "سلوى", "سوده", 
    "سيهات", "شارع", "شاطى نصف القمر", "شجعة", "شدقم سكن شركة ارامكو", "شركة ال منير ومجموعة كسارات", 
    "شركة البنعلي للطرق", "شركة الحفر العربية", "شركة العسيس", "شركة انشاء الطرق", "شركة بول العربية", 
    "شركة جتكو", "شركة جيكات المحدوده", "شركة دلمون", "شركة معادن", "شركه الحسين والعفالق للخرسانه", 
    "شركه العجمى", "شركه سبك خلاطه", "شعاب مزارع", "شفيه", "شهيل", "شهيلاء", "صفوى", "صلاصل", "صلاله", 
    "عاليه", "عتيق", "عجايب", "عرج", "عرده", "عريعره", "عصيفرات", "عنك", "عين دار الجديده", "عيون دحباش", 
    "غرابه", "غزلان (محطه كهرباءغزلان)", "غمسى", "غنوى", "فريج الرمل", "فوده", "قرحش", "قرحش", 
    "قرية العليا - الرفيعه", "قريه السفلى", "قريه الصفيره", "قريه العباء", "قريه العليا", "قصوان", 
    "قصيبا", "قلمه ام الهشيم", "قلمه خالد", "قهوه القصيبيه", "كامب شركة المري للمقاولات", 
    "كسارات عبد الرسول ومشروع العرجاني الزراعي", "كسارات علي العجينه ومجموعه كسارات", "كسارة ال حمد الدوسري", 
    "كسارة الطريس", "كسارة اليمامه", "كسارة بن لادن", "كسارة شركة العسيس", "كسارة عبدالرزاق البشير", 
    "كساره المشرق", "كمب ام عشره", "كمب شركة اتحاد المقاولين", "كمب لآلي السعوديه", "متالع", 
    "مجمع ابا الخيل التجاري", "مجمع ابن حديجان", "مجمع المدينة السكنيه", "مجموعة بن لادن السعوديه", 
    "مجموعة كسارات عبدالعالي العجمي وعددها 5", "مجموعة كسارات وعددها 8", "مجموعة مزارع", 
    "مجموعه كساره الخرسانيه", "محاجر وكسارات ابوالعينين ومجموعه كسارات", "محطة الذهبية", 
    "محطة الخليج العربي (1)", "محطة الخنيني", "محطة الخنيني رقم (20)", "محطة الدبدبه", 
    "محطة الروابي (روابي السوبان)", "محطة الطريفه", "محطة الغاطي", "محطة الغلاب", "محطة بن صفيان", 
    "محطة جوده ومحطة فيصل ومصنع تعبئة الشعير", "محطة خبيراء", "محطة ساسكو", "محطة صيانة طريق البطحاء", 
    "محطة ضخ الخرسانية ومعمل ارامكو", "محطة طريق حرض", "محطة ناصر العرق", "محطة واسواق الشاميه", 
    "محطة ومزرعة ابوجعشه", "محطةالخنيني رقم (14)", "محطه ال سفر", "محطه الخالدى", "محطه الخليج العربي (2)", 
    "محطه الخنيني", "محطه الخنيني رقم (2)", "محطه السعدون", "محطه الشعبه", "محطه تحت الانشاء", 
    "محطه خباري وضحى", "محطه فرز خريص لفرز الغاز عن الزيت (1)", "مدينة الملك خالد العسكرية", 
    "مدينه الجبيل الصناعيه", "مريخ", "مريطبه", "مزارع أبوسبعه", "مزارع أم العراد", "مزارع البختيه وماجاورها", 
    "مزارع الجعيمه", "مزارع الدسمه", "مزارع الشيط الشرقيه", "مزارع الفاو الجنوبي", 
    "مزارع الكواكب ومجموعه مزارع", "مزارع اللهابه", "مزارع اللهابه الشماليه", "مزارع الهلبيه", 
    "مزارع جوده", "مزارع طريق عريعره الاحساء", "مزرعة احمد سالم", "مزرعة الحبيل", "مزرعة الحسيني", 
    "مزرعة السويكت", "مزرعة الصافي", "مزرعة العروق", "مزرعة الغرافه", "مزرعة الغريري", "مزرعة القاضي", 
    "مزرعة حسين العلي", "مزرعة دار السلام", "مزرعة دار السلام وماجاورها", "مزرعة فهد بودي", 
    "مزرعة ماجد الدويش", "مزرعة ندى", "مزرعه ابن سرحان", "مزرعه الصبيغاوى ومجموعه مزارع", "مزرعه العرقان", 
    "مزرعه الكويخه", "مزرعه المطاوعه", "مزرعه على دخيل (ام الحيران)", "مزرعه منصور بن فهيد", "مسيكه", 
    "مشروع البندريه الزراعي", "مشروع العرجاني الزراعي", "مشروع المنديل", "مشروع حرض (نادك) وماجاورها", 
    "مشروع سكة حديد بن لادن", "مشروع عقد 205 الصيانة", "مشله", "مصنع اسمنت الشرقيه", "مطربه", "مطربه", 
    "معرج السوبان", "معمل أرامكو بخريص", "معمل فرز الحرمليه", "معمل فرز الغاز بحرض", "معمل فرز غاز رقم (2)", 
    "معمل فرز غاز رقم (3)", "معمل فرز غاز رقم 4", "مغطى", "مقرسكن موظفي أرامكو", "ملدان", "مليجه", 
    "مليحه", "مناخ", "منتزه الامير سلطان البحري", "منصورة الشهامه", "منفذ العديد", "ميدان بشاير", 
    "ميدكو شركة كهرباء", "هجر جوف بنى هاجر", "هجرة ابن مهيلب (ام النثايل)", "هجرة الأحمدية", 
    "هجرة البجسه", "هجرة الجيبان العميم", "هجرة الجيشيه", "هجرة الحنى", "هجرة السالمية", "هجرة السكك", 
    "هجرة السيح", "هجرة الطويلة", "هجرة العبدليه", "هجرة العنقريه", "هجرة الفرداني", "هجرة القراين", 
    "هجرة اللواء", "هجرة النايفية", "هجرة ام اثله", "هجرة تماني", "هجرة جنيح", "هجرة حمض", 
    "هجرة شليويح بن شلاح (الشلاحيه)", "هجرة فضيلة", "هجرة مزرعة الطليعة", "هجرة وسيع", "هجره الحفاير", 
    "هجره الخن الجديد", "هجره الخن القديم", "هجره الزومان (هجرة ابوطينه)", "هجره القباليات", 
    "هجره المحدار", "هجره المطق الراشديه", "هجره بئر العازب (القليبه)", "هجره بركان", 
    "هجره مطلق شافى (الرديفه)", "هديه", "ويسه", "يبرين", "يكرب", "الحي", "إختر الحي"
]

cities_2nd = [
    "آل عياش", "أم القصبى", "أم عثمان", "اباد البيضاء", "ابدان", "ابن جباع", "ابن دوخى وابن ساعد", 
    "ابن رزيقه", "ابن عرد الغربة", "ابن غراء", "ابن كحيلان", "ابن محضره", "ابو الكراوين", 
    "ابو المروه", "ابو المعاصب", "ابو سنينه", "ابو شواك", "ابو مدين", "ابوالبير", "ابوالحصين", 
    "ابوالدحال", "ابوالدحله", "ابوالرشيده", "ابوالريع", "ابوالسدره", "ابوالسلعه", "ابوالغشوه", 
    "ابوالقتاده", "ابوحبس", "ابوشوك", "ابوصفيح", "ابوعريضه", "ابوغابره", "ابوغار", "ابوغبار", 
    "ابوقبرين", "ابومدابغ", "احد القفره", "اريمه", "اسفل الخمر", "اسفل وادي خارم", "اصل ابو فلاح", 
    "اصل الخياله", "اضم - الحدبه", "اعلى وادي خارم", "اعماق", "افه", "ال باخ الاسفل والاعلى", 
    "ال بخات", "ال بسيس", "ال ثبات", "ال جابر", "ال حميد (باعج حمام)", "ال دغمان", "ال دكنان", 
    "ال رداد", "ال رداد ال سليم", "ال زارع", "ال زاهي", "ال زياد العقاربه واهل الراس", "ال ساحه", 
    "ال سالم", "ال سحاب", "ال سرور", "ال سرور", "ال سعدان السفلى", "ال سعدان العليا", "ال سعيدان", 
    "ال سعيدان الجنوبيه", "ال سكان والفرره", "ال سكران", "ال سلمان", "ال سنامه", "ال شيبان", 
    "ال صرار", "ال صقاعه", "ال طارق", "ال طاهر", "ال ظافر (أحمار)", "ال عاطف وقرى جمان والغانم وهوشه", 
    "ال عافيه", "ال عامر", "ال عطيه", "ال عيفه", "ال قعدان", "ال ماشى وعنقه", "ال مثناه", "ال مرزوق", 
    "ال نعمان", "ال نعمه", "الأخليله", "الأراك الأعلى والأسفل", "الأسحر", "الابيرق", "الاثايبه", 
    "الاثنين", "الاثيله", "الاحد", "الاحيرش", "الازاهره", "الاشتاء", "الاشراف", "الاضاعنه", 
    "الاطاوله", "الاعبل", "الاعراش", "الاعصم", "الاعصيمات", "الاعلى", "الاغبر الاسفل", "الاغبر الاعلا", 
    "الاغصان", "الاقزع", "الاقزع", "الامري", "الانصب", "الاوشح", "الاوقع", "الايكه", "الباثه", 
    "الباحة", "البارك", "البدله", "البدوان والمضحاة", "البديع", "البراقه", "البردى", "البرطيخ", 
    "البزياء", "البشيماء", "البضعه", "البطحاء", "البعيثه", "البلينيه", "البهره", "البهيم الأعلي", 
    "البهيمه", "البوره", "البويره", "البياضه (ام الهارب)", "البيت الجديد", "البير الخالدية", 
    "البيضاء", "البيضاء", "البيضاني", "البيطيره", "الترايغه", "الترس", "الثدى", "الثراوين", 
    "الثعبان", "الثقفيه", "الثمده", "الثويمات", "الجاره", "الجاوه", "الجبجبه", "الجبره", "الجبله", 
    "الجبهه البير", "الجبور", "الجحافين", "الجدلان", "الجديفه (الثلاثاء)", "الجذي", "الجرازة", 
    "الجره", "الجريره", "الجرين", "الجزيلي", "الجعده السفلى", "الجعده العليا", "الجفدره", 
    "الجفن الاعلى", "الجلب", "الجماء", "الجماجم والدركه", "الجميل", "الجناب", "الجنابين", "الجندل", 
    "الجندله", "الجهلان", "الجهله", "الجهمه", "الجوار", "الجوار", "الجوف", "الجوفاء", "الجوه", 
    "الجوه", "الجيف", "الحاجب", "الحارث", "الحارك", "الحاره", "الحازم", "الحازم الاعلى والاسفل", 
    "الحامر", "الحاوى", "الحايره", "الحايز", "الحبقه", "الحبوا", "الحبوه", "الحبيس", "الحجران", 
    "الحجرة", "الحجرة - الامره", "الحجرة - الحدبه", "الحجرة - الحمده", "الحجرة - الحنكه", 
    "الحجرة - الرهوه", "الحجرة - الضرس", "الحجرة - الفرعه", "الحجرة - القريع", "الحجرة - القزعه", 
    "الحجرة - المرباء", "الحجرة - الولجه", "الحجرة - زعره", "الحجرة - شعير", "الحجرة - طلان", 
    "الحجرة - فاجه", "الحجرة - مروان", "الحجره", "الحجروف", "الحجه (سياله الحجة)", "الحدب", 
    "الحدب", "الحدب", "الحدب", "الحدبان", "الحدبه", "الحدبه البيضاء", "الحدق", "الحده", "الحراء", 
    "الحراء والشريقه", "الحريقه", "الحسن", "الحشاش", "الحشرج", "الحشف", "الحشو", "الحشوه", 
    "الحصمه", "الحصون", "الحضن", "الحضيرى", "الحطاوره", "الحظيره", "الحفاه", "الحفر", "الحقوين", 
    "الحكمان", "الحلاله", "الحلاه", "الحلاه", "الحلسه", "الحلفه", "الحله", "الحلو", "الحلوق", 
    "الحليمه", "الحليمه", "الحليه", "الحماطه", "الحمراء", "الحمرات", "الحمره", "الحمضه", "الحمود", 
    "الحميدان", "الحميراء", "الحميراء (المضباع)", "الحناديد", "الحناظى", "الحنانى", "الحنجور", 
    "الحنوين", "الحواريه", "الحواه", "الحوايا الحداب", "الحوته", "الحوج", "الحوشبيه", "الحوشه", 
    "الحومة", "الحويل", "الحيد (الصهوه)", "الحيض", "الحيموم", "الخاجه", "الخاشع (حصن البير)", 
    "الخاشه", "الخالدية", "الخالف", "الخالف", "الخالف", "الخانق", "الخبيره", "الختاميه", "الخدره", 
    "الخراره", "الخرب", "الخرب", "الخربه", "الخربه الحمراء", "الخرطوم", "الخرمه", "الخشبه", 
    "الخشناء", "الخطام", "الخفج والخفيج", "الخفش", "الخلفاء", "الخلوه", "الخليف", "الخليفه", 
    "الخمايل", "الخمر", "الخيمه", "الدار الوسطى", "الدارين", "الدجارين", "الدحض", "الدحظ", 
    "الدحله الحنكه", "الدحمه", "الدحيل", "الدخول", "الدراويش", "الدركه", "الدشه", "الدعبه", 
    "الدقم", "الدقمين", "الدكان", "الدكدك (النقعه)", "الدمغه", "الدهامشه", "الدهامين", "الدهنه", 
    "الدهيناء", "الدوسرى", "الذراع", "الذنبه", "الذهب", "الراسين", "الرافعيه", "الرايمه", "الربض", 
    "الربوه", "الرخامين", "الرخم", "الرخيله", "الرشده", "الرششه", "الرصعه", "الرضعه", "الرطمه", 
    "الرقبان", "الرميضه", "الرهفه (النفبة)", "الرهوان", "الرهوان", "الرهوة", "الرهوتين", "الرهوه", 
    "الرهوه والسحيمه", "الرهي", "الروس", "الريانه", "الريحان", "الريع", "الريعه", "الريعه", 
    "الزاويه", "الزباره", "الزبده", "الزبيه", "الزربه", "الزربه", "الزرعه", "الزرقان والحصنين", 
    "الزروق", "الزغل", "الزغله", "الزير", "الساق والغربه", "السبتاء", "الستار", "السحارى", 
    "السحر", "السحره والمجرد والقمره", "السحير", "السديد المطين", "السراق", "السراق", "السرفه", 
    "السطيحه", "السلاطين ودليم", "السلته وال بن غالية", "السلعه السفلى", "السلمه", "السليم", 
    "السليم", "السليم الأسفل", "السليم الاعلى", "السمحه", "السمراء", "السمير", "السند", "السنه", 
    "السهساه", "السهله", "السهمان", "السهومه", "السواند", "السوداء", "السوسيه", "السويسيه", 
    "السيار", "الشتفه", "الشراء", "الشراحيين", "الشراقيه", "الشرج الأسفل", "الشرج الأعلى", 
    "الشريج", "الشريق", "الشطابه", "الشطه", "الشعب", "الشعب", "الشعب الاعلى", "الشعب الشامى(موقع عام)", 
    "الشعب اليمانى", "الشعبه", "الشعبه السفلى", "الشعبه العليا", "الشعبه والتوبه", "الشعبين", 
    "الشعبين", "الشعره", "الشفاء", "الشفاء", "الشقيب", "الشقيب", "الشمله", "الشهابيه", 
    "الشواشيه الذراع", "الشوال", "الشوحطه", "الشوق", "الشويكاء", "الشيق و هميجان", "الصافح", 
    "الصباخ", "الصبح الاسفل", "الصبح الاعلى", "الصخره", "الصخير والرحبه", "الصدر", "الصدره", 
    "الصريف", "الصعابين", "الصعاليك والمليح", "الصعبه", "الصعدان", "الصغواء", "الصفا", "الصفا", 
    "الصفاح", "الصفارده", "الصفح", "الصفراء", "الصفوات", "الصفوق", "الصفيراء", "الصقران", 
    "الصلال", "الصليله", "الصليله", "الصماء", "الصماء", "الصميماء", "الصنقه", "الصنم", 
    "الصوايد ومزرعة الامير مشعل", "الصور", "الصور", "الضاحي", "الضبر", "الضبر الاسفل", "الضبر الاعلى", 
    "الضبيعات", "الضحوات", "الضليف", "الضمو", "الضيقه", "الطبيقه", "الطرف", "الطرف", "الطرف", 
    "الطرف", "الطرف", "الطرف", "الطف", "الطلاقه السفلى", "الطلاقه العليا", "الطمعه", "الطنف", 
    "الطوق", "الطوله", "الطويله", "الطويله", "الطيبه", "الطيشان", "الطيف", "الطيف", "الطينة", 
    "الظفير", "الظفير", "الظليف وضواحيها", "الظهار", "الظهره", "العارض", "العاصد", "العبادل", 
    "العباديه", "العباريه", "العجار الاسفل", "العجار الاعلى", "العجره", "العجيجة والاسنام", 
    "العدفه", "العدن", "العدنه", "العديه", "العذا", "العذبه", "العراق والحويه", "العراونه", 
    "العرايس", "العرباء", "العرق", "العريش", "العسيله", "العشباء", "العشوه", "العشوه", "العصداء", 
    "العصده والصقره", "العصيده السفلى", "العصيده العليا", "العطارده", "العطافه السفلى", 
    "العطافه العليا", "العفيف", "العقب", "العقب", "العقده", "العقله", "العقيصاء", "العقيق", 
    "العقيق - الثوده", "العقيق - الحائط", "العقيق - الحفنه", "العقيق - الدحله", "العقيق - السريح", 
    "العقيق - العرقين", "العقيق - النباعه", "العقيمة", "العقيمة", "العكبره", "العكس", "العلو", 
    "العليليه", "العمر", "العمير", "العنبه", "العوجاء", "العيص", "العيصمات", "الغار", "الغبارى", 
    "الغبر الاسفل", "الغبر الاعلى", "الغبراء", "الغبراء", "الغبشه", "الغران", "الغرباء والاثمه", 
    "الغرف", "الغره", "الغرير", "الغصه والجوفاء", "الغله", "الغمار", "الغوله", "الغيضه", "الفاتح", 
    "الفارع", "الفارعه", "الفجة والقماريه", "الفجره", "الفرح", "الفرزة", "الفرشه", "الفرع", 
    "الفرع", "الفرع السند", "الفرعه", "الفروه", "الفريس", "الفريشه", "الفريه", "الفزار", "الفزر", 
    "الفصائل", "الفصيلة", "الفصيله وال مسعود", "الفظاظه", "الفقار", "الفقهاء", "الفقهاء والرتوع", 
    "الفلاح", "الفلجه", "الفلق", "الفهيده", "الفهيده العليا", "الفيرع", "الفيشه", "الفيض", "القابل", 
    "القامره", "القامه", "القبل", "القبه", "القتب", "القتب", "القحمان", "القحيم", "القدحه", 
    "القدر", "القرانه", "القرعاء", "القرعه", "القرن", "القرن", "القرن", "القرن", "القرن الاخضر والمرابي", 
    "القرنوه", "القرى", "القرى", "القرى", "القرى الاسفل", "القرى الاعلى", "القري", "القري - الحبشه", 
    "القري - السريح", "القري - العرقين", "القري - المراث", "القري - النباعه", "القري - فاجه", 
    "القريان", "القريده", "القريعاء", "القريعه", "القرين", "القريه", "القزاع", "القزعه", "القزعه", 
    "القسمه", "القصيباء", "القضاء", "القضايا", "القضيمه", "القطاعاء والقاع", "القظيمه", "القعبليه", 
    "القعبه", "القعر", "القعرات", "القعره", "القعره", "القعره", "القعره بني عدوان", "القعصه", 
    "القعود", "القعور", "القفره", "القليته", "القماعه", "القمده", "القمع", "القنبوع", 
    "القنفذه والقرانه", "القهاب", "القهاد", "القهيب", "القوابره", "القوارير", "القواعد", "القوز", 
    "القياس", "الكاحدين", "الكاحله", "الكببه", "الكبسه", "الكثانه", "الكدس", "الكدفه", "الكديد", 
    "الكرادسه", "الكراع", "الكربه", "الكرى", "الكري", "الكظامه", "الكعته", "الكفته", "الكلاهسه", 
    "الكلبات", "الكلبه", "الكورس", "الكيله", "اللبده", "اللج مليح", "اللج وسندالضلع", "اللجمه", 
    "اللحيان", "اللحيان", "اللصق", "اللغاميس", "اللغبه", "اللويه", "المالك", "المبارك", "المباعيث", 
    "المبرق", "المبنى", "المتلوى", "المثاميل", "المثناه", "المثناه", "المثيله", "المجارى", 
    "المجازه", "المجيمر", "المحاطبه", "المحاميد", "المحبس", "المحجاه", "المحجره", "المحرق", 
    "المحظره", "المحنى", "المحني", "المخاضه السفلى", "المخاضه العليا", "المخباة", "المخصر والالحاب", 
    "المخواة - البيضاء", "المخواة - الجوار", "المخواة - الحائط", "المخواة - الحدبه", "المخواة - الحفنه", 
    "المخواة - الحمده", "المخواة - الشقره", "المخواة - الصهوه", "المخواة - العشيره", "المخواة - القتيباء", 
    "المخواة - القرن", "المخواة - المراث", "المخواة - المرباء", "المخواة - المزرعه", "المخواة - المضحاه", 
    "المخواة - غياض", "المخواة - مليل", "المخواه", "المخواه", "المداهره", "المدره", "المديده", 
    "المدير الاعلى والاسفل", "المديسات", "المرابيح", "المرباه", "المربى", "المرتباء", "المرخه السفلى", 
    "المرخه العليا", "المرصاد", "المروه", "المروه الجنوبيه", "المروه الشماليه", "المريبى وحناك الرين", 
    "المزبن", "المزرع", "المزيرعه", "المساعده", "المساعده", "المساعيد", "المساقه", "المسروح", 
    "المسعد", "المسعود", "المسفر", "المسلم", "المسمور", "المسيل", "المشارق", "المشاطيه", "المشايعه", 
    "المشباب", "المشرع", "المصاقير", "المصانعه", "المصبخ", "المصدره", "المصمعد", "المضايف", 
    "المضباع الاعلى", "المضحاه", "المضحاه", "المضحاه والحشف", "المضهي", "المطارفه", "المطلوح", 
    "المطيريه", "المعامره والعرق والصعب وال فرحان", "المعرم", "المعزه", "المعصوم", "المعقد", 
    "المعقر", "المعقل دار النهراوه", "المعوله", "المعيض (المعاكين)", "المعين", "المعيوده", 
    "المغثه", "المغرس", "المغميق", "المقارنه", "المقارى", "المقرر", "المقشع", "المقصره", 
    "المقصره(شواحط)", "المقطر", "المقطع", "المقعد", "المقمره", "المقنعات", "المقنعه", "المقيقى", 
    "المكاتيم", "الملاقي", "الملاليح", "الملتقى", "المليح", "المليح الاعلى", "المليحه السفلي", 
    "المليحه العليا", "المنتدى", "المندق", "المندق - الثوده", "المندق - الحبشه", "المندق - الحصحص", 
    "المندق - القزعه", "المندق - غياض", "المنزل", "المنظر", "المنكب", "المهاديه", "المهدمه", 
    "الموبره", "المولجه", "الميدان والغصنة", "الميفاء", "الميلاء والزبن", "الميلح", "الناصفه", 
    "النبعه", "النبعه", "النبعه", "النبغه", "النتر", "النسور", "النشم", "النشيم", "النصبا", 
    "النصبه والدار العليا", "النعره", "النعيم", "النغره", "النفره", "النماره", "النمره", "النهضه", 
    "النوايف", "النوزه", "الهتافره وقحزه", "الهجيج", "الهدماء", "الهده", "الهدوان والقهبان", 
    "الهره", "الوبره", "الوتيد بكرش", "الوحشه", "الوريفح", "الوزر", "الوسطه", "الوسيط", "الوكف", 
    "الوهده", "الوهسه والقناه", "اليمنه", "ام الاجراف", "ام الثمام", "ام الحجرين", "ام الحمام", 
    "ام الصوان", "ام الضهيانة", "ام القعشر", "ام المحال", "ام عمر", "ام غربان", "ام مصلى", 
    "بئر الطوى وقاع شريان", "بئر بحري", "بات", "باديه", "بالنعمان", "بدادا", "براج", "برحرح السوق والجحاف", 
    "بركاء", "برمه", "بريده", "بطيح", "بطيله", "بلاد موسى", "بلجرشى", "بلجرشي - المزرعه", "بلوعر", 
    "بنى حريم", "بنى دكه", "بنى محمد", "بنى هريره (الحصنين)", "بنى يحمد", "بني حسن", "بني حسن - زعره", 
    "بني عطا", "بني كبير", "بني والبة", "بهر الشرقي", "بهر الغربي", "بيت ابن عازب (المضاحي)", 
    "بيت الحبس", "بيت المرضى", "بيت حسين", "بيت على صالح المالكي", "بيضان", "بيوت الاصقع", 
    "بيوت عصيدان", "تربة الخيالة", "ترم غل", "ثعلب", "ثقيب", "ثمن", "ثوله", "جافان", "جانب البرمه", 
    "جانب الرابعه", "جبل قراما", "جبيله والمقعده", "جدر", "جرب", "جرد", "جعاله", "جليس", "جمان", 
    "جميله", "جناب ال داهش", "جناب شكر", "جنيده", "حادله", "حاره العبيد", "حازم الكلبه", "حاضر", 
    "حبس ابن زينه", "حبس ابو قشعه", "حبس الأشرم", "حبس الاثنى", "حبس الادوحه", "حبس الحاوى", 
    "حبس الحقيبه", "حبس الحوايل", "حبس الخاشع", "حبس الرجع", "حبس السبقيه", "حبس الفيوق", 
    "حبس المجوبه", "حبس المرايغ", "حبس المسروح", "حبس المعديات", "حبس برعمه", "حبس جعده", 
    "حبس خريشه", "حبس رحيل", "حبس على ابن يحيى", "حبس معجب", "حتار", "حتى", "حجن", "حداب النجيم", 
    "حدب الدرب حدب الطريق", "حدبة ابو حبوان", "حدبه ابوحنبله", "حدبه العوجاء", "حدبه القهيب المخطط", 
    "حدبه الكراع", "حدبه صياح", "حديد", "حراب", "حصن الجناب", "حصن الحبس", "حصن القرعه", "حصينى", 
    "حصيني الاعلى والاسفل", "حضاه", "حضاه", "حضن", "حضوه", "حظى", "حقو المعين", "حلايف", "حلايل", 
    "حلةالثبي", "حلحله", "حلحله السفلى", "حلق المخصوم", "حله الصله", "حله قلتان", "حلود", "حليس", 
    "حماده", "حماده والموبل", "حموان", "حميس", "حناك العقارب", "حنذيه السلفه العليا", "حنظلا", 
    "حنف", "حنكه ابو عسل", "حنكه ابوالعقارب", "حنكه الاسيود", "حنكه الباثه", "حنكه الروبه", 
    "حنكه الصعاب", "حنكه الضميده", "حنكه بادى", "حنونه", "حواز", "حواز", "حواله", "حويته", 
    "خاتمه", "خاشع دثينه", "خباب", "خبه", "خبه", "خبه والعجاريد", "خدور ذي ورق(الباطن)", 
    "خدور وادى ضبا", "خدور وادى عشره", "خدور وادى نمر", "خره", "خريق الحمسه", "خريق الروزه", 
    "خريق الصيد", "خريق سعد", "خشعان", "خشم مسكه", "خضيره", "خميس الشعراء", "خومان", "خيره", 
    "دار ال سعيد", "دار الاعرق", "دار المريم", "دار الوادى", "دارالسوق", "دبيان", "دثنه", 
    "دحال عبدالله", "دغش", "دغماء", "دفه", "دقم الحزيز", "دقم الخريق", "دقم السفوة", "دقم الشديده", 
    "دقم القلفوع والعصداء", "دقم بهشه", "دقم حجر رعى", "دقم حصين", "دقم زهير", "دهمه", "دهو", 
    "دوس بني فهم (بني يزيد)", "ذات الظبر", "ذات المقر", "ذات جليل", "ذي عين", "ذيب", "رايه", 
    "ربذان", "رحبان", "رخزه", "رسباء", "رضعان", "رفده", "رمس والدولان", "رهوة العلنصه", 
    "رهوه ابن عوف", "رهوه الشراء", "رويعات قراد", "ريع السفاهيه", "ريع السوق", "ريع القطاع", 
    "ريع الكحيل", "ريع الوابل", "ريعان", "زحاف", "زعنه", "زغفه", "ساق عامر", "سالم", "سبيحه السفلى", 
    "سبيحه العليا", "ستيت", "سعار", "سكرات", "سلامان", "سلامه", "سلطانه", "سمعه السفلى", "سميره", 
    "سند الحلوه", "سند الدف والمعاقد", "سند الربعه", "سند العوجاء", "سند القهب", "سند المضحاه", 
    "سند المليح", "سند النجيل", "سند الوضاحيه", "سند حزام", "سهاوه", "سهل المعدان", "سهيله", 
    "سوق الحجره", "سيال", "سيحان", "سيلات", "سيلب", "شاحب", "شبيل", "شرهان", "شصا", "شصيان", 
    "شعابه الغر", "شعب الجيلاني", "شعب الحمار", "شعب الحمر", "شعب الخصى", "شعب الدار", "شعب المغره", 
    "شعب النجول", "شعب خلف", "شعب سيال(موقع عام)", "شعب كلب", "شعبة ابو شحامه", "شعبه الدرع والجديعه", 
    "شعثه", "شعيب ذنائب الشمالى", "شقص", "شمرقيه", "شواحط", "شوله", "شوله", "صباب", "صخوان", 
    "صدر المحاميد", "صدر المزاوده", "صدر بير والركبين", "صدر رخام", "صدر مساعد", "صعايد", 
    "صعيد غزوان", "صفاق", "صلا", "صوبه", "صور الهطلان", "ضابى", "ضاجع", "ضبيعه", "ضبيعه", 
    "ضبيعه العليا", "ضجه", "ضهايا", "ضهايا وال سعيدان", "ضهياه", "طاووسه", "طلان", "ظبين", "ظها", 
    "ظهرالقرى", "ظهى واستن", "عارض شراز", "عبلاء ام السدره", "عبيد", "عبيكه", "عذيبه", "عرشا", 
    "عرض وجعه", "عرضان الراكه (دف حميضة)", "عرفه", "عريمه", "عصيبه", "عصير", "عفراء", "عفيرى", 
    "عقبه", "عقده ال سعد", "عمضان", "عنازه والانصب", "عنزين", "عوك", "عويش", "عياس ال حمامه", 
    "غافله", "غامد الزناد", "غبار", "غبيشه", "غدي العياش", "غرابه", "غريبات والحفياء", "غطيط", 
    "غطيط", "غليفه", "غياض", "غينه", "فاجه", "فاطش", "فاعه", "فحلة", "فران وال شبل", "فرشه الحده", 
    "فرعة غامد الزناد - الصهوه", "فرعة غامد الزناد - الظليف", "فرعة غامد الزناد - العشيره", 
    "فرعة غامد الزناد - العين", "فرعة غامد الزناد - القتيباء", "فرعة غامد الزناد - القرن", 
    "فرعة غامد الزناد - القريع", "فرعة غامد الزناد - مروان", "فرعة غامد الزناد - مليل", "فرعه السلاطين", 
    "فضاله السفلى", "فطيس", "فلج و الرزز", "فلل", "قاع سحيم", "قاعس", "قبضه", "قحيش", "قدران", 
    "قذانه", "قرا الظهر", "قراء", "قراشع", "قرعه", "قرعه", "قرن ابو الصرحه", "قرن ابوالحشحاش والردمه", 
    "قرن الجرفه", "قرن الحدق", "قرن الدمث", "قرن الذويب", "قرن الشريف", "قرن الطائف", "قرن العسل", 
    "قرن الملايسه", "قرن النثله", "قرن ظبى", "قرن عامر", "قرن عطيه", "قرى", "قرى ال حشيف", 
    "قرى الحويه", "قرى الدار", "قرى السد", "قرى الصفى", "قرى الطائف", "قرى الغبران", "قرى الغراب", 
    "قرى المجنه", "قرى المزروبه", "قرى المشروك", "قرى المعمر", "قرى مجذوم", "قرية الصدرة", 
    "قرية دنفان", "قريده والقعره", "قريعه", "قرين", "قرين ساريه", "قريه ابو الرعود", "قريه ابو شطيره", 
    "قريه ابوهبيره", "قريه ساعد", "قريه وقهاوى ليف", "قزعه الغراب", "قزعه المقطع", "قزعه سريع", 
    "قعيان", "قعيشم", "قلوة - الامره", "قلوة - الجوار", "قلوة - الحصحص", "قلوة - الحفنه", 
    "قلوة - الحمده", "قلوة - الحنكه", "قلوة - الدحله", "قلوة - الرهوه", "قلوة - الشقره", 
    "قلوة - الصهوه", "قلوة - الضرس", "قلوة - الظليف", "قلوة - العبلاء", "قلوة - العشيره", 
    "قلوة - العين", "قلوة - الفرعه", "قلوة - القزعه", "قلوة - المريخ", "قلوة - النبعه", 
    "قلوة - الولجه", "قلوة - شعير", "قلوة - طلان", "قلوة - فاجه", "قلوه", "قمهده", "قهب العصيده", 
    "قهب المحرق", "قواهر", "قوبيع", "قوران", "قوع", "كتيب", "كحلة", "كدره ظلافه", "كربه ثاله", 
    "كروان السويدى", "كروان العبادى", "كسارات ابن عيوش والغامدي", "كسارة الخليج", "كشاد", 
    "كمب شركه المبطى", "كيسان", "لبوة السفلى", "لزمه", "لفقه ومطروح", "لهن", "ليف", "ليف الاعلى", 
    "ماطوه", "ماطوه", "ماطوه", "ماطوه و الجندل", "مبايع", "مبيع", "مثيب", "مجمع الاسكان الخيري", 
    "محربه", "محرقه (فضاله العليا)", "محل الاصانقه", "محل عطيان والحفرات", "محويه", "محويه", 
    "مخشوش", "مخشوش", "مخشوشه", "مدايع", "مدر", "مدسه", "مدلل", "مدهاس", "مديره", "مذغان", 
    "مراوه", "مربخ", "مركوب", "مروح", "مزارع ابوعريضه", "مزارع داهكه حظى", "مزارع غليل بتربه", 
    "مزارع مليس وماحولها", "مزرعة يحيى بن عتيق", "مزرعه سعد بن حصينى", "مسعده", "مشده", "مشرفه", 
    "مشروع اسكان الوليد", "مشنيه بيت احمدالبهيجه", "مصادم", "مضحاه ال يحمد", "مضحاه المشايخ", 
    "مطارده", "معاتيب", "معشوقه", "معشوقه", "معوض", "مغايض", "مكبب", "ملح", "ملحتين", "ملف القوارير", 
    "مليقطه", "منحل الاسفل", "منحل الاعلى", "مندسه", "منشله", "منضحه السفلى", "منضحه العليا", 
    "مهد الغبه", "مهد شواحط", "مهد عشره", "مهد عمق", "مهيوب العمائر", "مولغ والكعامير", "ناب المنشقر", 
    "ناوان", "نبعان", "نبهان", "نشمه", "نعجان", "نغيله الحسين", "نفق", "نمار", "نيراء بالديان", 
    "هفان", "وادى اعماق(موقع عام)", "وادى الحزر(موقع عام)", "وادى المحجاه(موقع عام)", 
    "وادى بات(موقع عام)", "وادى ثاله(موقع عام)", "وادى جدامه", "وادى رام", "وادى رشوه", 
    "وادى سمعه", "وادى طفاله(موقع عام)", "وادى فروحه(موقع عام)", "وادى لبوه", "وادى لومه(موقع عام)", 
    "وادى مدع(موقع عام)", "وادى مشان(موقع عام)", "وادى ملتح", "وادى ناوان(موقع عام)", 
    "وادي الأحسبة", "وادي الوابه", "وادي انيام", "وادي تربه", "وادي ريم", "وادي شعثان", 
    "وادي ممنا", "وادي نصبه", "واسعه", "وقاده السفلى"
]

cities_3rd = [
    "أصفان", "أطناب", "ابو عجرم", "ابورواث", "اثره", "اجربه", "الاضارع", "الامغر", "البريمات", 
    "الثنيه", "الجراوى", "الجضيعة", "الحديثه القديمه", "الحرة", "الحماد", "الحمى", "الحنوه", 
    "الرحبه", "الرديفة", "الرديفه", "الرفيعة", "الرفيعه", "الزقاقيه", "السحل", "الشويحطيه", 
    "الصيانه للطريق", "العقيله", "العيساويه", "العين البيضاء", "الفياض", "الفياض ( القنيطره )", 
    "القرقر", "القريات", "القلته", "الكيسومه", "اللويزه", "المروت", "المرير", "المرير وأم قصير", 
    "المغتبيه", "المندسه", "الناصفه", "الناصفه (النواصره)", "النباج", "النبك ابوقصر", "النظائم", 
    "الهياظله", "ام رجوم", "ام صليله", "ام طرفاه", "ام فرس", "باير", "بسيطاء", "بويضاء الكيسومه", 
    "ثنيه ام نخيله", "جبل العبد", "جماجم", "خوعاء", "دومة الجندل", "روض البقر", "روض العاقول", 
    "روض المزارع", "روضه حجلان", "رياض حنين", "زلوم", "سكاكا", "شرق صبيحا", "شعيب طلحة طبرجل", 
    "شغار", "شيبه", "صبيحا", "صديع", "صوير", "طبرجل", "طلعة عمار", "عذفاء", "عين الحواس", 
    "غدير الخيل", "غطى", "فياض قليب خضر", "قاره الحمار", "قليب خضر", "كاف", "كسارات الشعيره", 
    "كسارة المسعد", "محجه", "محطة الروسان", "محطة طلعة زلوم", "محيريث", "مركز رديفة الجماجم", 
    "مزارع ابو دويد", "مزارع ابو عجرم الشرقيه", "مزارع ابو عجرم الغربيه", "مزارع الرافعيه", 
    "مزارع العدائم", "مزارع الفياض", "مزارع المعرس الغربية", "مزارع ام المقابر", 
    "مزارع ام كهف النحاس", "مزارع روضة الصخال", "مزارع شويحط", "مزارع ظلماء", "مزارع فياض العيساويه", 
    "مزارع قيال", "مزارع مغيرا", "مزارع ومشاريع بسيطاء", "مزرعة سلطانه", "مشروع الدواجن", 
    "منفذ الحديثه", "منوه", "ميقوع", "هجرة دعبوس", "هدبان ومزارعه", "هديب", "وريك"
]

cities_4th= [
    "ابن سوقي", "ابن شريم", "ابورواث", "ابوصور بن جبرين", "استراحة مشعل مطارد الرويلي", 
    "اسكان العايد", "اعيوج لينه", "الجراني", "الجميمة", "الحدق", "الحدقة", "الحدقه", 
    "الخر", "الخشيبي", "الدويد", "الربيع", "الرفاع", "السليمانية", "الشاظي مناحي بن بكر", 
    "الشركة السعودية للصناعات الميكانيكية", "الصحن", "العجرميه", "العويقيله", "الغنام (خب سحّاء)", 
    "القصوريات", "القعساء", "الكاسب", "المركوز ويشمل", "المصندق", "المعيد", "الهبكه", 
    "الهلالي", "ام أرضمه", "ام خنصر", "بادية الطويريق", "جديده عرعر", "حزم الجلاميد", 
    "رغوة", "رغوه الجديده", "رفحاء", "روضة هباس", "زبالا", "زهوه", "ساده الخر نعيجان", 
    "سماح", "شركة الانماء المحدوده لحفر الآبار", "شركة معادن", "شعبه نصاب", "شعيب طريف", 
    "شمقل بن رمال (الايديه)", "طريف", "طلعه التمياط", "عرعر", "غنيم", "فرقة صيانه طرق رقم 5", 
    "قيصومه فيحان", "كريم", "كسارة الحربي", "كسارة الدبيكل", "كسارة السقاف سبك", "كسارة العايد", 
    "كسارة الغريب", "كسارة المهيلب", "كسارة المهيلب", "كسارة سبك ( 2 )", "كسارة م / عقيل العنزي", 
    "كمب شركة العايد", "لوقة", "لينه", "مؤسسة الدوسان", "مؤسسة الروسان للمقاولات", 
    "مجمع كسارات سبك", "محطة الخليج", "محطة المديد", "محطة واستراحة البكر", "محطه الخليج", 
    "مخيم صيانة الطريق 2", "مزارع المركوز", "مزرعة المساجديه", "مزرعة المساعدية", 
    "مزرعة جزاع اليرمان", "مزرعة شريدة محمد مرشد", "مزرعة صياح", "مزرعة عبدالعزيز الحمود", 
    "مزرعة علي زبدان", "مزرعة مدالله عليان الحازمي", "مزرعة ممدوح ذومان اليرومات", 
    "مشروع الجوفي", "مشروع تسمين اغنام الخناني", "مشروع دواجن الحضيري", "مشروع مزرعة الزمام", 
    "مصنع اسمنت الجوف", "مصنع اسمنت المنطقة الشمالية", "مورد بن دويهم", "نصاب", 
    "هجرة الرغلية", "هجرة السلـمانية", "هجره عوده الجبهان"
]

cities_5th = [
    "ابن سوقي", "ابن شريم", "ابورواث", "ابوصور بن جبرين", "استراحة مشعل مطارد الرويلي", 
    "اسكان العايد", "اعيوج لينه", "الجراني", "الجميمة", "الحدق", "الحدقة", "الحدقه", 
    "الخر", "الخشيبي", "الدويد", "الربيع", "الرفاع", "السليمانية", "الشاظي مناحي بن بكر", 
    "الشركة السعودية للصناعات الميكانيكية", "الصحن", "العجرميه", "العويقيله", "الغنام (خب سحّاء)", 
    "القصوريات", "القعساء", "الكاسب", "المركوز ويشمل", "المصندق", "المعيد", "الهبكه", 
    "الهلالي", "ام أرضمه", "ام خنصر", "بادية الطويريق", "جديده عرعر", "حزم الجلاميد", 
    "رغوة", "رغوه الجديده", "رفحاء", "روضة هباس", "زبالا", "زهوه", "ساده الخر نعيجان", 
    "سماح", "شركة الانماء المحدوده لحفر الآبار", "شركة معادن", "شعبه نصاب", "شعيب طريف", 
    "شمقل بن رمال (الايديه)", "طريف", "طلعه التمياط", "عرعر", "غنيم", "فرقة صيانه طرق رقم 5", 
    "قيصومه فيحان", "كريم", "كسارة الحربي", "كسارة الدبيكل", "كسارة السقاف سبك", "كسارة العايد", 
    "كسارة الغريب", "كسارة المهيلب", "كسارة المهيلب", "كسارة سبك ( 2 )", "كسارة م / عقيل العنزي", 
    "كمب شركة العايد", "لوقة", "لينه", "مؤسسة الدوسان", "مؤسسة الروسان للمقاولات", 
    "مجمع كسارات سبك", "محطة الخليج", "محطة المديد", "محطة واستراحة البكر", "محطه الخليج", 
    "مخيم صيانة الطريق 2", "مزارع المركوز", "مزرعة المساجديه", "مزرعة المساعدية", 
    "مزرعة جزاع اليرمان", "مزرعة شريدة محمد مرشد", "مزرعة صياح", "مزرعة عبدالعزيز الحمود", 
    "مزرعة علي زبدان", "مزرعة مدالله عليان الحازمي", "مزرعة ممدوح ذومان اليرومات", 
    "مشروع الجوفي", "مشروع تسمين اغنام الخناني", "مشروع دواجن الحضيري", "مشروع مزرعة الزمام", 
    "مصنع اسمنت الجوف", "مصنع اسمنت المنطقة الشمالية", "مورد بن دويهم", "نصاب", 
    "هجرة الرغلية", "هجرة السلـمانية", "هجره عوده الجبهان", "آل بريك", "آل قرنين", "آل وهيط", 
    "أبرقية", "أبو عرفج", "أفيعية (افويعية)", "أم الديبان", "أم طلحة", "أم مريخ", "أوثيلان", 
    "ابا الرحي", "ابا الساكت", "ابا الصلابيخ", "اباالجرفان", "اباالرخم", "اباالعبلان", 
    "ابار البارده", "ابار الحفنه (هجره الفزعه)", "ابار الطويل", "ابرق القصير وقارة الفرس", 
    "ابرق جو (مريصيص)", "ابرقية", "ابن جـوباح", "ابن شعيل", "ابو ارطى", "ابو برقان", 
    "ابو جلال", "ابو حثم مزرعة سليمان الغزي", "ابو حميض", "ابو خسيفه", "ابو خياله", 
    "ابو رجوم", "ابو ركب", "ابو ركبه", "ابو رمل", "ابو سدر", "ابو سروح", "ابو سليم", 
    "ابو سليم", "ابو صمود", "ابو صنم", "ابو طرفات", "ابو طلحه", "ابو طليح", "ابو عرينه", 
    "ابو عشر", "ابو غيران", "ابو لبده", "ابو مروه", "ابو نخله", "ابو نخله", "ابو هيا", 
    "ابوجفاره", "ابورخيم", "ابوسدره والمعطف", "ابوعشره", "ابوكعب", "ابومرخ", "ابوهريم", 
    "اثيثيه", "ارطاوى الحماميد", "ارطاوى الرقاص", "ارطاوى حليت", "ارطاوي السرداح الجنوبي", 
    "استراحات جنوب العماجيه ومحطة قرطبة", "استراحات منسوبي القاعده", "استراحات وكسارات شمال", 
    "استراحة ابن داهم", "استراحه السعدى", "استراحه ومزارع فيحاء العتش", "اسكان شركة اسمنت الرياض", 
    "اسكان وزارة الدفاع", "اشيقر", "اعبليه", "افقرة", "ال حفيان", "ال خليف", "ال عرمان", 
    "ال عيبان", "ال غبيش", "الأحمدية بالجمش", "الأساسية", "الأطوى", "الاثله", "الاحمر", 
    "الادغم ظهر الحمار", "الارطاوى", "الارطاوى الشمالي", "الارطاوي", "الارطاوي الجديد", 
    "الارطاويه", "الارطاويه الجنوبيه", "الارطاويه الشماليه", "الارمض الشمالى", "الارمضى", 
    "الاشعريه", "الافلاج", "الافلاج - الجبيله", "الافلاج - الروضه", "الافلاج - العليا", 
    "الافلاج - ام اثله", "الامار", "البادرية", "البادريه", "الباعجه", "الباينيه", "البتيراء", 
    "البجاده", "البحره", "البخراء", "البدائع", "البدائع", "البدائع", "البدريه", "البدع", 
    "البديع", "البديعه", "البديعه", "البديعه", "البراعيم السود", "البراقيه", "البرحية", 
    "البرقاء", "البركه", "البره", "البره", "البساتين", "البعيثه", "البعيرية", "البلاد", 
    "البهره", "البهيانيه", "البواردى", "البوق", "البوق والنفيد", "البويرده", "البويزم مشروع الحربي", 
    "البياضا", "البير", "البيرقات", "البيضه", "البينه", "البييرات", "التسرير", "التنيبيكيه", 
    "التنية", "التوضيحيه", "التويم", "الثامرية", "الثامرية", "الثعل", "الثقفيه", "الثليماء", 
    "الثماله", "الثماميه", "الثماميه", "الثندوه", "الثوير", "الثويريه", "الجابريه", 
    "الجابريه", "الجاذي", "الجافوره", "الجافيه (المحواز)", "الجامعية", "الجاهزة", "الجاهلي", 
    "الجايزيه", "الجثوم", "الجدعاء", "الجدعاء", "الجديده", "الجديده", "الجديده", "الجرباء", 
    "الجربوعه", "الجرويه", "الجريسيه", "الجريفه", "الجفارة", "الجفره (وسيلة الشمالية)", 
    "الجفير", "الجفير", "الجفير", "الجلة", "الجلة الجنوبي", "الجلة وتبراك", "الجله", 
    "الجله القديم", "الجماعين", "الجمانيه", "الجمش", "الجناب (العيديه)", "الجنادريه واستراحه القميش", 
    "الجنوبية", "الجنوبية بسدير", "الجنيفى", "الجنينه", "الجهيميه", "الجو", "الجواره", 
    "الجوبه", "الجوى", "الجويات ومزارع شرق الارطاوي", "الجويفاء", "الحائر", "الحار", 
    "الحار", "الحازميه (الرفيعه)", "الحاضرية", "الحاكميه", "الحامدية", "الحامريه(عيبان)", 
    "الحاوي", "الحاوي", "الحاويه", "الحاير بسدير", "الحبابيه", "الحبرديه", "الحجاجى", 
    "الحديثه", "الحذيانه", "الحرجه", "الحرمليه", "الحريدي", "الحريق - الحريق", "الحريق - الحفنه", 
    "الحريق - الربواء", "الحريق - الغبي", "الحريق بالوشم مزارع العيسى والسياري بالحماده", 
    "الحزم", "الحزم", "الحزم", "الحزم والبطينه", "الحسو", "الحسى", "الحسي", "الحسيان بلدة الصفرات", 
    "الحسينيه", "الحسينيه", "الحشيف", "الحصا المرزز", "الحصاة", "الحصون", "الحفاير (بن العمياء) والمجمعة", 
    "الحفاير (حفيره الوهوهى)", "الحفر", "الحفنه", "الحفيره", "الحفيه", "الحلقه السفلى", 
    "الحلقه العليا (حلقة بن جلبان)", "الحلوة", "الحلوه", "الحلوه", "الحليفه", "الحماده", 
    "الحماده", "الحماده", "الحمدانيه (خيم)", "الحمرانيه", "الحمره", "الحمضه", "الحمضيه", 
    "الحمه", "الحميسيه", "الحنابج", "الحنو", "الحنوب (المنتزة)", "الحوار", "الحواشيه", 
    "الحوميات", "الحوي", "الحويته", "الحوير", "الحيانية و البرك", "الحيانيه", "الحيد القديم", 
    "الحيدالقديم والجديد", "الحيسيه", "الخاتله", "الخاصره", "الخاصره القديمه", "الخالدية", 
    "الخالدية بالحصاة", "الخالديه", "الخالديه بالعهن", "الخبراء الجديده", "الخبه", "الخبي", 
    "الخبيزيه", "الخرايق", "الخرج", "الخرج - الرفاع", "الخرج - الرويضه", "الخرج - العزيزيه", 
    "الخرج - تمير", "الخرفه", "الخروعيه", "الخروعيه", "الخروعيه القديمه", "الخريصية", 
    "الخريمه ومحطه الوهيبي", "الخزاميه", "الخشبى", "الخشبى", "الخشن الأعلي", "الخشن الاسفل", 
    "الخضاره", "الخضر", "الخطامه", "الخفق", "الخفق ومزارعه", "الخفيسة", "الخفيفيه", 
    "الخلايق (الخلايق الشرقيه والغربيه)", "الخليفه", "الخليفيه", "الخليل", "الخميليه", 
    "الخنيقية العليا", "الخنيقيه ومنجم الذهب", "الخوار", "الخواره", "الدابره", "الداخله", 
    "الداره", "الداره", "الداره", "الداهميه", "الداهنه", "الدايخيه", "الدبيجه", "الدبيسية", 
    "الدحوه", "الدريعاء", "الدسمه", "الدعليه (الرحمانيه)", "الدعيب", "الدعيبية", "الدغيميه", 
    "الدلامى", "الدلم", "الدمثى", "الدهاسيه", "الدهم", "الدوادمى", "الدوادمي - البجاديه", 
    "الدوادمي - البدع", "الدوادمي - البرود", "الدوادمي - البطين", "الدوادمي - الثامريه", 
    "الدوادمي - الجرفيه", "الدوادمي - الحفاير", "الدوادمي - الحفنه", "الدوادمي - الحفيره", 
    "الدوادمي - الخالديه", "الدوادمي - الدرعيه", "الدوادمي - الذيبيه", "الدوادمي - الرفاع", 
    "الدوادمي - الريان", "الدوادمي - السدريه", "الدوادمي - السليمانيه", "الدوادمي - الشفا", 
    "الدوادمي - العاذريه", "الدوادمي - العزيزيه", "الدوادمي - العناديه", "الدوادمي - العوشزيه", 
    "الدوادمي - الفيحاء", "الدوادمي - الفيضه", "الدوادمي - المرقبيه", "الدوادمي - الناصريه", 
    "الدوادمي - الوسيطاء", "الدوادمي - ام الشيح", "الدوادمي - ام القطا", "الدوادمي - برزان", 
    "الدوادمي - جلاله", "الدوادمي - ساموده", "الدوادمي - عشيره", "الدوادمي - عواضه", 
    "الدوادمي - مغيرا", "الدوليه", "الدويره", "الديريه", "الذلوقيه", "الراجحيه", "الراس", 
    "الراشده", "الرافديه", "الرايغه", "الربوا", "الربوه", "الرجع", "الرجع", "الرجع", 
    "الرحامين", "الرديفة", "الرديفه", "الرزح", "الرزه", "الرزيزاء", "الرزيقيه", "الرزيوه", 
    "الرشاويه", "الرشيدى", "الرضمية", "الرضيمات", "الرضيمه", "الرغيب", "الرفاع", "الرفايع", 
    "الرفايع (ال سعد)", "الرفايع بالرين", "الرفايع بالوهوهى", "الرفايع بحلبان", "الرفايع بسر ال كعده", 
    "الرفايع ومزارعه", "الرفيعة", "الرفيعة", "الرفيعة", "الرفيعه", "الرفيعه", "الرفيعه", 
    "الرفيعه", "الرفيعه", "الرفيعه", "الرفيعه", "الرفيعه", "الرفيعه", "الرفيعه ومزارعها", 
    "الرقاشيه", "الرقة الجنوبية", "الرقة الشمالية", "الرقصانيه", "الرقعه", "الرقميه", 
    "الرقميه العليا", "الرقميه الوسطى", "الرقيبه", "الركيات", "الركيه (ركية بن سحمان)", 
    "الرماديه (المورقيه)", "الرمحيه", "الرمحيه القديمه والجديده", "الرمحيه والبطين", 
    "الرميثى", "الرواما", "الروسان", "الروضة", "الروضه", "الروضه", "الروضه", "الروضه القديمة", 
    "الروضه ومزارعها", "الروغ الاسفل قصرآل شافي", "الروقيه", "الرويبضه", "الرويضه", 
    "الرويضه (رويضه شايع)", "الرويضه بسدير", "الرويعية", "الرياض", "الريان", "الريان", 
    "الريشيه", "الريعانيه", "الريمه ومشروع الريمة للمواشي", "الرين", "الرين الاعلى", 
    "الرين القديم", "الزبائر", "الزبارة", "الزباره", "الزباره ومزارعها", "الزبداني", 
    "الزبيره", "الزعفرانه", "الزلفى", "الزلفي - البديعه", "الزلفي - الحموديه", "الزلفي - الرفيعه", 
    "الزلفي - الصالحيه", "الزلفي - العاذريه", "الزلفي - الفيصليه", "الزلفي - عشيره", 
    "الزلفي - مغيرا", "الزهر الامني", "الزهره", "الزويدية", "الساحبه", "الساحبه ومزارعها", 
    "السالميه", "السالميه", "السالميه", "السالميه", "السالميه", "السالميه", "السايح", 
    "السايله وال نومه", "السباحيه", "السبعاني (السبعان)", "السحيمى", "السحيميه", 
    "السديرى الاعلى (جثله الشتلانيه)", "السر", "السرحي", "السرداح", "السرداحيه", "السره", 
    "السره بالحفيره", "السكران", "السلام", "السلطانيه", "السلمان", "السلمانية", "السلمية", 
    "السلميه", "السلميه", "السلميه", "السلميه (الشرقيه)", "السلوع", "السليسيه", "السليل", 
    "السليل - البطين", "السليميه", "السموحيه", "السناريه", "السناريه", "السناميه", 
    "السنده", "السهليه", "السوقيه", "السيباني", "السيح", "السيح", "السيح", "السيح", 
    "السيح الجنوبي", "السيح الشمالى", "الشامانية", "الشاميه", "الشاميه", "الشاه", 
    "الشاهريه", "الشبنانيه", "الشبهانه", "الشتينيه", "الشجري", "الشحاطيه", "الشحمه", 
    "الشداديه", "الشديده", "الشرعانيه", "الشرف", "الشرميه", "الشطبه", "الشعب", "الشعراء", 
    "الشعلانيه", "الشعيب الاحمر", "الشفاء", "الشفاء", "الشفلحيه", "الشلويه", "الشمال", 
    "الشميطاء", "الشنيفيه", "الشهباء", "الشواطن", "الشواه", "الشويمية", "الشيحيه", 
    "الشيديه", "الصاخن (أم اثله)", "الصالحيه", "الصالحيه", "الصالحيه", "الصالحيه", 
    "الصالحيه", "الصالحيه", "الصالحيه (العرضان)", "الصالحيه (حليت)", "الصاهد", "الصاهد", 
    "الصاهد", "الصاهد", "الصايلية", "الصبخه الجنوبيه", "الصبخه الشماليه", "الصبيحية", 
    "الصحن ومزارعها", "الصغو", "الصفراء", "الصفويه", "الصفيه", "الصقره", "الصقيع", 
    "الصليبيه والجوهريه", "الصمهوديه", "الصوح", "الصيهد", "الصيهد (ال ولمه)", "الضبطيه", 
    "الضبيعه", "الضحوى ومزارعـه", "الضربون لطرق (الزيقب)", "الضرسية", "الضيغميه", 
    "الطالعيه", "الطالعيه", "الطايلية", "الطراديه", "الطراه", "الطرفيه", "الطرفيه", 
    "الطرودي (الطروديات)", "الطليحيه", "الطوال", "الطوال (مركز امني الطوال)", "الطوقى", 
    "الطويرف", "الطويرفات", "الطويله", "الطويله الهلجان", "الظافريه", "الظاهريه", 
    "الظاهريه", "الظاهريه", "الظلماوى", "العاده (العوده)", "العازميه", "العامريه", 
    "العامريه (العرضان)", "العامريه بن بليعيص", "العايضية", "العباسية(ركنة صبر)", 
    "العباسيه", "العبدلي", "العبدليه", "العبده", "العبده ومزارع بطاحه", "العبل", 
    "العبله", "العبليه", "العجليه", "العجيبه", "العدالات", "العدامة", "العدامه", 
    "العدوه", "العدوه والمزارع الشرقيه", "العرجاء", "العرمه", "العريديه", "العريمى", 
    "العزيزية حلة الجعيد", "العزيزيه", "العزيزيه والعليا", "العسيبي", "العسيله", 
    "العضيانيه", "العطار", "العطاوى", "العطيان", "العطيشيه", "العفج", "العفجة", 
    "العفزريه", "العقلة", "العقله", "العقله", "العقيليه", "العقيمى", "العلا", "العلبشيه", 
    "العليا", "العليا (غار السناميه)", "العلياء", "العليابالحلوه", "العليجيه", "العماجية", 
    "العماجية", "العمار", "العمار", "العمار بسدير", "العماريه", "العماريه", "العمانيه", 
    "العمق", "العميريه", "العنتريه", "العهينه", "العوجاء", "العوراء", "العوشزية", 
    "العويجاء", "العويسيه", "العويند", "العيدانية", "العيضه (بن حيدان)", "العيطليه", 
    "العين", "العيينة", "العيينة", "العيينه", "الغاط", "الغاط - الغبي", "الغاط - مليح", 
    "الغالبية", "الغالبيه", "الغانميه", "الغانميه", "الغبياء", "الغرابة", "الغرابه", 
    "الغرابه ومزارعها", "الغربية", "الغربيه", "الغريبيه", "الغريري", "الغريزيه", 
    "الغزيز", "الغصابية", "الغويبه", "الغويره", "الغيدانيه", "الغيل", "الغيلانه", 
    "الفاخرية", "الفاخريه", "الفاخريه (المنبوزه)", "الفاو", "الفايزيه", "الفايزيه", 
    "الفايزيه", "الفايزيه ال هجاج", "الفحجاني", "الفحيل", "الفراجيه", "الفرده", 
    "الفرسيه", "الفرشة", "الفرشه وأم مريخ ( فرشه ام مريخ)", "الفرع", "الفرعة", "الفرعه", 
    "الفرعه", "الفرعه", "الفرعه", "الفرعه", "الفرعيه", "الفروثى", "الفريده", "الفريشه", 
    "الفسيحه", "الفقاره ومزارعها الشرقيه", "الفلاة", "الفهيدات", "الفواره", "الفويسه", 
    "الفويلق", "الفويلق الشمالي", "الفياح", "الفيحاء", "الفيحانية", "الفيصلية", 
    "الفيصليه", "الفيصليه", "الفيصليه", "الفيضة", "الفيضه", "الفيضه", "الفيضه", 
    "القاره", "القاعيه", "القاعيه بسدير", "القبابنه", "القحز", "القديمه", "القرار", 
    "القراره", "القراره", "القراين", "القرين", "القرينه", "القرينه", "القريه الشماليه", 
    "القصب", "القصوريه", "القصير", "القصير الشمالى", "القعره", "القلته", "القميش", 
    "القنزعية", "القوسه", "القويز", "القويع", "القويع", "القويعية - ابرقيه", "القويعية - ابو عشره", 
    "القويعية - البجاديه", "القويعية - البدع", "القويعية - البطين", "القويعية - الثامريه", 
    "القويعية - الحزم", "القويعية - الحنو", "القويعية - الخالديه", "القويعية - الخيس", 
    "القويعية - الربواء", "القويعية - الرفيعه", "القويعية - الرويضه", "القويعية - السالمية", 
    "القويعية - السدريه", "القويعية - السليمانيه", "القويعية - الشفا", "القويعية - العزيزيه", 
    "القويعية - العقله", "القويعية - العناديه", "القويعية - العوشزيه", "القويعية - الغشبه", 
    "القويعية - الغيدانيه", "القويعية - الفرشه", "القويعية - الفرعه", "القويعية - المرقبيه", 
    "القويعية - المزيرع", "القويعية - الناصرية", "القويعية - النباه", "القويعية - الوسيطاء", 
    "القويعية - ام اثله", "القويعية - ام القطا", "القويعية - ام طلحه", "القويعية - بيضاء نثيل", 
    "القويعية - جلاله", "القويعية - حويمضه", "القويعية - ساموده", "القويعية - مليح", 
    "القويعية - نميص", "القويعيه", "الكادسيه", "الكاسرية", "الكدرة والحزم", "الكسابيه", 
    "الكفية", "الكفيفية", "الكلاء ومزارعها", "الكواكب", "اللجاجيه", "اللغفيه", "اللكه", 
    "اللكه", "اللكه", "اللنسيات", "اللهيب", "اللويبانيه", "المانعيه", "المتياهه وماحولها من مزارع", 
    "المثناه", "المثناه", "المجذم", "المجذمية", "المجمعة - البرزه", "المجمعة - الخيس", 
    "المجمعة - ام طليحه", "المجمعة - برزان", "المجمعة - تمير", "المجمعة - حويمضه", 
    "المجمعة - مشرفه", "المجمعة - مصده", "المجمعه", "المجهليه", "المجهولية", "المحامه", 
    "المحرق", "المحسنية", "المحمدية", "المحمديه", "المحنسية", "المحوي", "المحيجر", 
    "المحير", "المخيتم", "المخيطيه", "المدارة", "المداره", "المداره", "المدرع", 
    "المديفع", "المربع", "المردمه", "المرزوقيه", "المريبخ", "المزاحمية - الجديده", 
    "المزاحميه", "المسبر (الوسطى)", "المستجده", "المستجده", "المستجده", "المستجده", 
    "المستجده", "المستجده ومرزوقه", "المستظله", "المستقله", "المستقيمه", "المستوى", 
    "المسفريه", "المشاعله", "المشاعله", "المشاعله والرفايع", "المشاعليه", "المشدقيه", 
    "المشعليه", "المشف", "المشنوطيه", "المصارير", "المصلوم", "المصيفقيه", "المطاوى", 
    "المطبقه", "المعتادية", "المعترضه", "المعتلي", "المعزه", "المعشبه", "المعلق", 
    "المعيزيلة", "المعيزيله", "المغادر", "المغرة", "المغره", "المغزالية", "المغزل", 
    "المغطى", "المغمي", "المغيدر", "المفلحيه", "المفيجر", "المقتسم", "المقوع", 
    "المقيبره", "المقيوع", "المكلاه", "الملحاء (هاله)", "الملحه", "المليح", "المليحاء", 
    "المليحه الطويلة", "المليحية", "المليحيه", "المنجور", "المنجور", "المنجور ومحطه ومركز الصفاء", 
    "المندسه", "المنسف", "المنصوره", "المنصورية", "المنصوريه", "المنيزل وام رمام وابوعوشز", 
    "المنيزله الصغيره", "المنيزله الكبيره", "المنيصف", "المنيفية", "المودنيه", "المورقيه", 
    "المويهيه", "النابية", "الناشريه", "الناصريه", "الناصفة", "الناصفة", "الناصفه", 
    "الناصفه", "الناظريه والرازنيه", "النايفية", "النايفيه", "النايفيه", "النباع", 
    "النبوان", "النبيبيع", "النجد", "النزهة", "النسق الجديد", "النسق القديم", "النشاش", 
    "النشنش", "النشيانية", "النظيم", "النظيم ومزارعه", "النغر", "النغيق", "النفيد", 
    "النقعة", "النقعه", "النمارى", "النهتيه الجديده", "النهضه", "النيصيه", "الهداجه", 
    "الهدار", "الهدار الجنوبي", "الهرار", "الهرانيه", "الهزميه", "الهشاشيل", "الهفوف", 
    "الهلالية", "الهلاليه", "الهلاليه", "الهمجة", "الهمجه", "الهمجه", "الهمجه", 
    "الهمجه", "الهمجه", "الهميج", "الهميج", "الهميج الداخلى", "الهنديه", "الهويديه", 
    "الهويمل", "الهياثم", "الهييشة", "الوادي للدواجن والاستراحات", "الوجيه", "الوحيرش", 
    "الوداعين", "الودعانية", "الودي", "الودينيه ومزارعها", "الوريكيه", "الوسيطا", 
    "الوسيطا", "الوسيطا", "الوسيطا وعشيرة والحزميه", "الوسيطاء", "الوسيطاء", "الوسيطاء", 
    "الوسيطى آل وحير", "الوسيعه ومزارعها", "الوطاه", "الوفره", "الوقف القرائن", 
    "الوهابيه ومزارعها", "اليمامه", "ام اجدير", "ام ارجوم", "ام ارطاء", "ام ارطى الجنوبيه", 
    "ام ارطى الشماليه", "ام الجثجاث (شاربة ماها)", "ام الجماجم", "ام الخزان السليمانية", 
    "ام الدباء", "ام الرجاجيل", "ام السباع", "ام السمر", "ام الشطن", "ام الشطن", 
    "ام الصفار الشرقيه", "ام الصفار الغربيه", "ام الصفار والحرف", "ام العظام", 
    "ام الفهود", "ام القرضى", "ام المناشير", "ام ايبد", "ام بيره", "ام ثمام", "ام جريف", 
    "ام جفر", "ام حرمل", "ام حيش", "ام خرجين", "ام خرق (القراره)", "ام رجوم", "ام رضمه", 
    "ام رغل", "ام زموع", "ام سدره", "ام سدره", "ام سديره", "ام سرحه", "ام سرحه", 
    "ام سريح", "ام سريحة", "ام سريحه", "ام سريحه", "ام سلم", "ام سلمة", "ام سليم", 
    "ام سليم", "ام سليم", "ام سواد", "ام شيح", "ام طلحة", "ام طلحه", "ام طليح ومزارعها", 
    "ام طليحه", "ام طليحه", "ام عاذر", "ام عليبه (ال ظافر)", "ام عليبه بصماخ", "ام فرص", 
    "ام قويع", "ام مرخ", "ام مرخ(برقعان)", "ام ملاكيك والبيان", "ام نخله", "ام نخله", 
    "ام نويعير", "ام هضيد", "امارة منطقة الرياض - الجبيله", "امارة منطقة الرياض - الدرعيه", 
    "اميه جارى (ام الهجاري)", "اوضاخ", "بئر عبدان", "بئر عبيد (محسن)", "بئر محمد بن مثيب", 
    "بئر هملان", "باديه الداهنه", "بحار ومزارعه الشماليه والجنوبيه", "بحيران والعرفاء", 
    "بخيته", "بدائع الدلابحه", "بدائع العصمه", "بدائع القراره", "بدائع المصلوم", 
    "بدائع بن نجم", "بدائع سويقه (سويقه)", "بدائع قرينسيات", "بدايع العضيان", "بدع ابن عرفج", 
    "بديده", "بديده المورقيه", "براحه المفرق", "براحه جهام", "برق الخيل", "برودان", 
    "بشاير", "بطاحة", "بطين عرق الدسم", "بعيثران", "بعيثران", "بلثقاء", "بن رده ومزارعها (صدر عريدان)", 
    "بن شميسان", "بنبان", "بني نعيم", "بهته", "بهجه", "بوضاء بسدير", "بير مصيبيح", 
    "بيضاء نثيل", "بيضاء نثيل(عشيرة)", "بينة بالسرداح", "بينه", "تبراك", "تجمع سكاني الحنية", 
    "تقطيع رخام خريشان", "تمره", "تمريه", "تنومه", "تيماء", "ثادق", "ثادق - العليا", 
    "ثادق - محطة ساسكو", "ثرمداء", "ثعبان", "ثمينهة", "جاحد الأمني", "جاحد الاعلى والاسفل", 
    "جبيله", "جديدة الاسودة", "جديده متيعب", "جراب", "جرشبه", "جريسه", "جريسه", 
    "جزالا", "جزيل", "جفن", "جفن ضب ومزارع دابس", "جفناء", "جلاجل", "جله الظبا ( جليله الضبا)", 
    "جنديه", "جنوب مخطط الخماسين الزراعي", "جهام", "جهيمه", "جو", "جوى", "حاضرة نفي", 
    "حاضره الداهنه", "حجرفه", "حجيلاء", "حده (مشرفه)", "حديجه", "حديجه", "حراضه", 
    "حربه", "حرمه", "حريملاء", "حريملاء الحصاة", "حزوى", "حسو الحيد", "حشاشه", "حصينه", 
    "حصَانه", "حفاير الحمل", "حفاير بن خجيم", "حفاير بن هرجاب", "حفر العتش", "حفيره صماخ", 
    "حفيره نساح", "حلاة الجله", "حلبان", "حله جريس", "حله شايع بن مفلح", "حلوان", 
    "حماده الفروثى", "حمرور", "حميان", "حميمان", "حنو الرين", "حنيدر", "حوطة بني تميم - الفرشه", 
    "حوطة بني تميم - مصده", "حوطه بنى تميم", "حوطه سدير", "حوي الشل", "حويته", "حويره نساح", 
    "حى ال سلطان", "حى الشرف", "حي الشفاوي", "حي شعلانه", "خب الرضم", "خب القرو ومزارع", 
    "خبراء فاران", "خبيب الريم", "خربقا", "خريسان وحجيلانة", "خريصه", "خريمان", 
    "خضراء", "خضراء", "خطماء", "خف", "خفس دغره", "خفيجة", "خل ابو سدره", "خل ابو عشب", 
    "خل الحميدي", "خل الهيف", "خل عبدالله", "خل ملفى", "خليفه", "خنزير", "خويطره بالسدريه", 
    "خيران", "خيم الحصاة", "دابان", "داحس", "داحمه النبوان", "داحمه النبوان", "دارة المردمة", 
    "دارة كف", "دحله مذكر", "دراويش", "دساس", "دسمان", "دسمان", "دسمان", "دغمان", 
    "دقله", "دلقان", "دنهش", "دهو (هجره ابن صرير)", "دهو الاسفل", "دواجن الفروج الذهبي رقم1", 
    "دواجن الفروج الذهبي رقم2", "ذريع", "ذعيفان", "رضوى", "رغبه", "رغوه", "رفائع الهمدانة", 
    "رفاع السيح الشمالي", "رفايع أبو عشره", "رفايع الجمش", "رفايع المزينى", "رفايع المنجور", 
    "رفايع بن نقاء", "رفيعة بن مدهوس", "رفيعة خف", "رفيعة عشيران", "رفيعة كف", 
    "رفيعه العبادل", "رفيعه عواضه", "رماح", "رماح - الحفنه", "رماح - الحفيره", "رماح - المزيرع", 
    "رماح - محطة ساسكو", "رميثان", "رميحه", "روضة الشيابين", "روضة الطويل", "روضة الهيشه", 
    "روضة بلاعيس", "روضة بن حباب", "روضة عسعس", "روضة عنز", "روضة مصودعة", "روضه الفرس", 
    "روضه القوازين", "روضه المحرق والثامريه", "روضه جهام", "روضه ذياب (قريقرا)", 
    "روضه سدير", "روضه شبيرمه", "روضه عشيره", "رويضه السهول", "رويضه بوضاء", "رويغب", 
    "ريداء", "ريع حولي", "ريمان", "رييه", "زعفرانه", "زميقه", "زنقب", "ساجر", "ساحب", 
    "ساقى الناهض", "ستاره", "سحيلة", "سدوس", "سدير", "سدير جمل", "سديره", "سديرى اللحاوى (السديري)", 
    "سديرى بن حقان الوسطى", "سديرى بن سحيلان", "سروره", "سعد", "سعده", "سفره", "سلطانة", 
    "سلطانة", "سلطانه", "سلطانه بالجله", "سليسان", "سماح", "سمراء", "سميح", "سميره", 
    "سميره", "سنام", "سنقيه", "سنيدان", "سنيده", "سهله", "سويدان", "سويس", "سيح القطين", 
    "شاربه ماها", "شاليهات اليمامه واستراحات شمال", "شبوه", "شبيرمه", "شبيكان", 
    "شبيكه", "شحاذة", "شراف", "شرثه", "شرف الزهره", "شركة اجزالا(كساره)", "شركة العايد", 
    "شركة الفنار", "شركة الفنار والكهرباء", "شركة تقطيع الحجارة والرخام", "شركة صيانة الطرق", 
    "شركة معادن", "شركه ارامكو للضخ", "شركه كهرباء وادي الدواسر", "شقراء", "شقراء - الحريق", 
    "شقراء الشكيره ومزارع حاجز الشيخ", "شلاخ", "شويه", "شيحة (قصر المشوح)", "صالحية بن حمد", 
    "صالحية كف", "صاهد الشبرم", "صاهد العكشان", "صبحاء", "صبحاء الشعيب", "صبحاء القديمة", 
    "صبحاء القرنه", "صدعان", "صرير", "صفاقه", "صفيه", "صقران", "صلبوخ", "صويه", 
    "صيحه", "ضبه", "ضرما", "ضرما - الفيحاء", "طارف ابوعرينه", "طحي", "طرقة سويلم", 
    "طريف", "طلحه", "طلحه خنوقه", "طينان", "ظفره", "عامريه شعيفان", "عباب", "عباده", 
    "عباده", "عبده", "عبلا اليميني", "عبلاء", "عبلاء الرفيعه", "عبلاء القرينات", 
    "عبله الرفايع", "عبله خف", "عبله مطربه", "عبليه", "عجابه", "عجاج ومزارعه", 
    "عرجاء", "عرقه", "عروى", "عرويلة", "عريده", "عريفجان", "عريوي ومزارعه", "عسيفه", 
    "عسيلان وفرعة عسيلان", "عسيلة", "عسيلة", "عسيلة النير", "عسيله", "عسيله الوسطى", 
    "عشيران", "عشيران ومزارعها", "عشيرة سدير", "عشيره", "عشيره المخامر", "عصماء", 
    "عصيله", "عصيم ومزارع عصماء", "عضوى", "عضيدان", "عطيشانه", "عطيه", "عـصـام", 
    "عفرية", "عفيف", "عفيف - ابرقيه", "عفيف - ابو عشره", "عفيف - البديعه", "عفيف - البرزه", 
    "عفيف - الجرفيه", "عفيف - الجميماء", "عفيف - الحفاير", "عفيف - الحماده", "عفيف - الحموديه", 
    "عفيف - الخالديه", "عفيف - الذيبيه", "عفيف - الروضه", "عفيف - السالمية", "عفيف - السليمانيه", 
    "عفيف - الطويله", "عفيف - العقله", "عفيف - النباه", "عفيف - برزان", "عفيف - بيضاء نثيل", 
    "عفيف - ساموده", "عفيف - عواضه", "عفيفة", "عقله", "عقيله الذويخ", "عقيله الفريح", 
    "علقه", "علياء", "عليان", "عمره", "عنان", "عنز", "عنيزان", "عواضه الاشعرية", 
    "عوده سدير", "عويجاء", "عيدان", "عين البراحه", "عين الصوينع", "عين القنور", 
    "عيون الافلاج", "عيينان", "عيينه ال حميد", "عيينه الهمله", "غسله", "غضى", "غضيه", 
    "غمره", "غيانه وحرقان", "فايزه", "فايزية الشبرم", "فايزيه الحدباء", "فراثان وسران", 
    "فرحة", "فرده", "فرش المنسف", "فرشه سويس", "فرعة ابو عشرة", "فرعة الثعل", 
    "فرعة وادي عصيل", "فرعه الحفنه", "فرعه الرميثى", "فرعه الوهوهى", "فرعه جفناء", 
    "فوار العريقات", "فوارات الفرشه", "فويسه", "فيحانه", "فيصلية الشغار", "فيضة الريشية", 
    "فيضة بن سعيدان", "فيضة غثاه", "فيضة منيه", "فيضة نومان", "فيضه اعبليه ومزارعها", 
    "فيضه الجمانيه", "فيضه الجمش", "فيضه الحماده", "فيضه الرميثى", "فيضه القوازين", 
    "فيضه المفص", "فيضه النطعان", "فيضه الهييشه", "فيضه حجيلاء", "فيضه خف", "فيضه سروره", 
    "فيضه سلام", "فيضه عفيف", "قاع مغيرا", "قاعده الامير سلطان", "قبيبان", "قبيعه", 
    "قبيل", "قحقح", "قران", "قرحش", "قرية الاوديرع", "قرية الناصفة", "قرية منيفة", 
    "قريه ديراب", "قصر القاسم", "قصر بن شلوان", "قصر بن نجيخان", "قصر حمام", "قصرالمرموثه", 
    "قصور ال مقبل", "قصور القصب", "قصور رغبه", "قصور شقراء", "قصيباء", "قعضب", 
    "قلته مليح", "قليب العليا (العليا)", "قليب مساعد (المساعديه)", "قمران", "قني", 
    "قنيفذه", "قهب الطير", "قويره النصي", "قويعان", "قويعان السحله", "قيران ومطربه", 
    "كافت", "كبشان", "كبيشه", "كتنه", "كحله", "كسارات ام الغربان", "كسارة الفهد ومجموعة كسارات", 
    "كسارة مؤسسة الطرق", "كساره ابا حسين", "كساره الهزاني-منوة", "كليه الملك عبدالعزيز الحربيه", 
    "كمب شركة العجمي", "كمب شركه العجمي للطرق", "كمب صيانه الطرق ومحاجر الحجر", 
    "كمده", "كويكب", "لبب", "لبخه", "لبيده", "لجع", "لجعه", "لحي", "لعلع", "ماسل", 
    "ماوان", "مباري", "مبايض", "مبهل", "متعبه", "مجمع الساروت للمحروقات", "مجمع مدارس طريق الحصاة", 
    "مجمع نجم الطريق", "مجموعه الكسارات الجنوبيه", "مجموعه كسارات", "مجموعه مزارع ابا الخرفان والوهيبي", 
    "مجموعه مزارع العتش", "مجموعه مزارع بدائع رغبه", "مجموعه مزارع شعيب البير", 
    "مجموعه مزارع شعيب ملهم", "مجموعه مزارع لذه", "مجيره", "محامة العقالية", "محامة بن زريبه", 
    "محامة بن طامي", "محامه المزيد", "محامه بن مصوى", "محطات بنزين الصفا", "محطات بنزين الغامدي", 
    "محطة ابن غنام والسجن", "محطة ابوالطلاح وماحولها", "محطة البراك", "محطة البياض", 
    "محطة الجدعانية", "محطة الخدمات البتروليه", "محطة العاصفة", "محطة المجد", "محطة المطلق", 
    "محطة المعدل للمحروقات", "محطة بتروليو", "محطة بن صقر ودواجن العريفي ومزرعة الدعيلج", 
    "محطة روابي طويق", "محطة روضة خريم", "محطة فيول واي", "محطة مبارك ال نادر", 
    "محطة مفرق حفر العتش", "محطة وأسواق اللحيدان", "محطة واستراحة المزاين", "محطه ابو دخن", 
    "محطه الباحوث", "محطه الجمعيه التعاونيه ومزارعها", "محطه الديري", "محطه السبتى", 
    "محطه السلام", "محطه الشرق الاوسط", "محطه الشلوى", "محطه الوسيع", "محطه ام رقيبه", 
    "محطه بن جبرين وكسارات", "محطه ساسكو", "محطه واستراحه العرنيه", "محطه واستراحه ساسكو", 
    "محطه ومزارع الغينه", "محيرقه", "محينذا", "محينذه", "مخطط استراحات العماريه", 
    "مخطط الخير", "مخطط الركا", "مخطط الصفرات الجديد", "مخطط درة الشمال", "مدارة العماجية", 
    "مرات", "مرات - الطويله", "مرات - ام الشيح", "مرات - ام سليم", "مرات - ام طلحه", 
    "مرات - ام طليحه", "مراغه", "مرغان", "مرقان", "مرقان", "مرقب فرعه ابوعرينه", 
    "مرقبيه الهييشه", "مركز الشفاء الامني", "مركز فرسان الشرق للخدمات البتروليه", 
    "مروان", "مريصيص (مرصص)", "مزارع ابو حيد", "مزارع ابو خياله", "مزارع ابو ركب", 
    "مزارع ابو علنده", "مزارع ابوزاحم", "مزارع اسفل الخنقه", "مزارع اسفل الرين", 
    "مزارع اسفل القويعيه", "مزارع ال ذران (زهره)", "مزارع الاديرع وام سليم", "مزارع الامير عبدالرحمن بن عبدالعزيز", 
    "مزارع الامير نايف والجماز", "مزارع الاوسط", "مزارع البطين ومزرعه دواجن", 
    "مزارع البطينه والفرعه", "مزارع البويطنات والقور", "مزارع الثميله", "مزارع الثندوه", 
    "مزارع الجناب", "مزارع الحرمليه", "مزارع الحشرج", "مزارع الحماده", "مزارع الحماده الجنوبيه", 
    "مزارع الحماده الشماليه", "مزارع الحور", "مزارع الخالديه", "مزارع الخفيسه", 
    "مزارع الخنقه", "مزارع الخويبيه", "مزارع الداهنه (القويطير الادني)", "مزارع الدغيبيس (الفروج الذهبي)", 
    "مزارع الدمثات", "مزارع الدمثة", "مزارع الدمثى", "مزارع الراجحى والسبتي والتوم", 
    "مزارع الراجحي", "مزارع الروضان", "مزارع الرويضه", "مزارع الريشيات والمفيض", 
    "مزارع السدريات", "مزارع السعيره والاوسط", "مزارع السكران الشرقيه", "مزارع السلق والفلق وسمحة", 
    "مزارع الشبرميه", "مزارع الشعب", "مزارع الشكره وهجرة الرجبه", "مزارع الشهيبيه", 
    "مزارع الصاهد", "مزارع الصدر جبل طويق", "مزارع الصقريه ( قليب الصقريه)", "مزارع الصواويه", 
    "مزارع الصوينع", "مزارع الضبيعة الشمالية", "مزارع الضبيعة الغربية", "مزارع الطويله (حزامه)", 
    "مزارع العاذريه", "مزارع العبله", "مزارع العدل ومحطة البطحاء (فال)", "مزارع العشيريه", 
    "مزارع العقيمى", "مزارع العلاوه وماحولها", "مزارع العين الجنوبية", "مزارع العين الغربيه", 
    "مزارع الغربية", "مزارع الغزيز", "مزارع الفالحيه", "مزارع الفقاره الغربيه", 
    "مزارع الفقير", "مزارع الفياض", "مزارع الفيضه", "مزارع القرنه الجنوبيه", "مزارع القرنه الشماليه", 
    "مزارع القرين", "مزارع المشاري", "مزارع المطاوي الشرقية", "مزارع المغيدير", 
    "مزارع الملقاء", "مزارع المليحه", "مزارع الملينه", "مزارع المهينى ومصنع اسمنت المدينة", 
    "مزارع النبايه", "مزارع النبوان", "مزارع النجفيه", "مزارع النخيل وماحولها", 
    "مزارع النصبيه", "مزارع النفود الجنوبيه البرادية", "مزارع النقيعه", "مزارع الوجاه", 
    "مزارع الودي الغربيه", "مزارع الوسيله", "مزارع الوعيب ونفجان", "مزارع ام الخفاس وصفية والملقاء", 
    "مزارع ام رضمه", "مزارع ام سليم (مصده)", "مزارع ام صحن", "مزارع ام طلحه", 
    "مزارع ام عرعر", "مزارع اوراط", "مزارع برمه", "مزارع بن ردعان", "مزارع جفن الشماليه", 
    "مزارع جفن الغربيه والشقيم", "مزارع جنوب القبابنه", "مزارع جنوب غرب اوسيله(ومحطة بتروليلى)", 
    "مزارع حمادة مليح الشماليه", "مزارع حويته ومحطه المفرق", "مزارع خادم الحرمين", 
    "مزارع خروب", "مزارع خريمان الشرقيه", "مزارع خريمان الغربيه", "مزارع دسمان", 
    "مزارع ديراب", "مزارع ذويبان", "مزارع زبده", "مزارع سلطانه", "مزارع شرق السهباء", 
    "مزارع شرق السيح", "مزارع شرق النبقيه", "مزارع شرق وشمال ساجر", "مزارع شرقات والدغيلبي", 
    "مزارع شعيب الخبيش", "مزارع شعيب القرنه", "مزارع شعيب المخضار", "مزارع شمال السهباء", 
    "مزارع شمال ام حزم", "مزارع صفراء البرود", "مزارع صفراء ساجر", "مزارع عبد العزيز بن احمد", 
    "مزارع عريفجان الشرقيه", "مزارع عين جزره", "مزارع غرب وشرق عسيله", "مزارع فحامه", 
    "مزارع قصر سعود (السحق)", "مزارع قصور النقعه", "مزارع قصور ثادق", "مزارع كبشان الجنوبيه", 
    "مزارع كبشان الشماليه", "مزارع مبهله", "مزارع محرقه", "مزارع محيرقه", "مزارع مصده", 
    "مزارع مصيقره", "مزارع معاويه", "مزارع مغيب بحقيل", "مزارع منيه", "مزارع نادك", 
    "مزارع نساح واستراحات الرحمانيه", "مزارع وادى الحنو", "مزارع وادى العماريه", 
    "مزارع وادي الرشا", "مزارع وادي وراط", "مزارع وادي وضخاء", "مزارع واستراحات جنوب بنبان", 
    "مزارع وثيلان الغربيه والجنوبية", "مزارع وثيلان ومزارع الامير عبدالرحمن", 
    "مزارع ومحطه مفرق المري", "مزرعة ابن جبرين", "مزرعة ابن حبجر", "مزرعة البكر ودواجن الأخوين", 
    "مزرعة الجماعة", "مزرعة الداود ومحطة محروقات", "مزرعة النخيلان", "مزرعة بن زبدان", 
    "مزرعة بن صالح القديمه", "مزرعة حمودبن عمر", "مزرعة زيد ( اللغف) وماجاورها", 
    "مزرعة سبيل", "مزرعة سلطان الدويش", "مزرعة عودة المردمه", "مزرعة مرضات", 
    "مزرعة هجاج المطيري وماحولها", "مزرعه ابو هضيد", "مزرعه الامير مشعل", "مزرعه البدرانيه", 
    "مزرعه الخالديه", "مزرعه الدهو", "مزرعه السليمان", "مزرعه القحطانى للدواجن والاغنام", 
    "مزرعه المرجان والجميعي ومشروع دواجن", "مزرعه الهويمل", "مزرعه امير الحسى", 
    "مزرعه بن شعلان الابرق وبن راشد", "مزرعه بن صالح الجديده", "مزرعه بن علي والدواجن وماحولها", 
    "مزرعه بن غشيان", "مزرعه بن ناصر", "مزرعه تركى بن سفاح", "مزرعه جفر بتران", 
    "مزرعه دواجن (رنده)", "مزرعه دواجن المحسن وماحولها", "مزرعه سليمان الخضيرى", 
    "مزرعه سليمان العساف", "مزرعه سمحان", "مزرعه عبدالرحمن ابوحميد", "مزرعه عبدالله المسفر", 
    "مزرعه فايز بن ذويبان الفايزية", "مزرعه فهد الماضي", "مزرعه ودي مزيد", "مزعل", 
    "مزعله", "مزله", "مساوى", "مسدح", "مسواق", "مشاريع الطواله", "مشاش السهول", 
    "مشاش القصب", "مشاش عوض", "مشانه الطوال", "مشذوبه", "مشرف", "مشرف", "مشرف ابو عشر", 
    "مشرفة الضليعي", "مشرفة القرنه", "مشرفة الكراشمه", "مشرفة المردمة", "مشرفة عسعس", 
    "مشرفه", "مشرفه", "مشرفه", "مشرفه نجخ (مشرفة الجمش)", "مشرفه نفي", "مشروع الدواجن", 
    "مشروع النخيل للدواجن", "مشروع تربيه النعام", "مشروع دواجن الدريس", "مشروع دواجن الغباش والرديني", 
    "مشروع دواجن المقحم", "مشروع دواجن الهندي والاخلاص والتنميه", "مشروع مخطط استراحات", 
    "مشلح", "مصده", "مصده", "مصكعه", "مصنع الغديرللصناعات الغذائيه", "مصنع نوفا لتعبأة المياه", 
    "مصيقره", "مصيقره القديمه", "مطربة", "مطربه", "مطربه", "مطيريحه", "معرج قليشه", 
    "معزوله ام الغنايم", "معقره", "معيزيله (هجرة حمد بن عبيد)", "مغيب", "مغيرا (الجديده)", 
    "مفرق الروضه وماحولها من مزارع", "مفرق جلاجل وماحوله من موقع عمل", "مفرق نجران", 
    "مقبولة", "مكميه", "ملهم", "ملهم القديمه ومزارعها", "مليحه البديعه (البدائع)", 
    "مليويط", "مملحه القصب", "منسيه", "منقاشه", "منيعه", "منيفه", "منيفه المغايره", 
    "منيفه جلوي", "منيه", "مهيضه ومغيرا", "موقع تقطيع الحجاره بخريصه", "موقف ساسكو وما حوله", 
    "مويسل", "مويسل", "نايفية", "نجخ", "نخل البوق", "نخيل الشمالي", "نخيلان", "نديان", 
    "نعام", "نعام", "نعجان", "نفجه", "نفى", "نقرة صالح", "نميلين", "هجرة آل شعيفان", 
    "هجرة آل شلعان", "هجرة الاوسط", "هجرة الجوفان", "هجرة الرفايع ومحطة بنزين", 
    "هجرة الزبيره", "هجرة الزهوه والبيان", "هجرة السالميه", "هجرة الضال", "هجرة العزيزية", 
    "هجرة العناديه", "هجرة الفريده والعليا", "هجرة اللغف", "هجرة اللهدة (المقوى)", 
    "هجرة المناخ", "هجرة النسيم", "هجرة الواحة", "هجرة بن سحمان", "هجرة بن مشنوطة", 
    "هجرة سمحه", "هجرة شوقه", "هجرة عشق", "هجرة ومزارع بوضان", "هجره ابا الروس", 
    "هجره ال مسيمع (الصدر الاعلى)", "هجره الحراقين", "هجره الذيبيه وخضراء", "هجره السدريه", 
    "هجره الطرفيه", "هجره الطيري (بئر الحرى)", "هجره العليا", "هجره العواطف", 
    "هجره النطاش والتراحيب", "هجره الوجاه", "هجره بن جفيران", "هجره بن طارد", "هجره بوضه", 
    "هجره خزام ومزارعه", "هجره دبيان", "هجره شلوان مزرعه العزيزيه", "هديان", "هذالات", 
    "همجات بني بدوة", "همجة المزيرع", "همجة السياحين", "همجه ابن قعيط", "همجه ابو قرنين", 
    "هندي", "هيت", "وادي الدواسر", "وادي الدواسر - الخالديه", "وادي الدواسر - الغشبه", 
    "وادي الدواسر - الناصريه", "وادي الدواسر - ام سليم", "وادي الدواسر - نميص", 
    "واسط", "وبره", "وثيلان", "وسيعه تمير", "وسيله", "وشى", "وعلة", "ونيسه (الكوده)"
]

cities_6th = [
    "مزارع البكيريه الشرقيه", "مزارع الشقه العليا", "أبانات", "أبو سديرة", "أم حرملة", 
    "أم ردهه", "أم لج", "ابا الهدار", "ابا الورود", "اباالحياص", "ابرق العمال", "ابرقيه", 
    "ابو جص", "ابو حماده", "ابو طريفه", "ابو طلح", "ابو قليبات", "ابو نخيل", "ابوطرفا", 
    "ابونخله", "استراحه وزاره المواصلات", "الأبرق", "الأشماط", "الأفيهد", "الاحمدية", 
    "الاخيضر", "الاديغم", "الارطاوي", "الاسامر", "الاسياح", "الاسياح - الطراق", 
    "الاسياح - مشرفه", "الاشيعل", "البتراء", "البدائع", "البدائع - السمار", "البديعه", 
    "البرجسيات", "البرقاء", "البساتين الشرقية", "البسيتين", "البصر", "البصيري", 
    "البطاح", "البطين", "البعجاء", "البعيثه", "البكره", "البكيرية - العلياء", "البكيريه", 
    "البندريه", "التنومه", "الثابتيه", "الثغيب", "الجحفه", "الجديدات", "الجراريه الجنوبيه", 
    "الجراريه الشماليه", "الجرثمى مزارع الجرثمي", "الجردانية", "الجرذاويه", "الجعله", 
    "الجفن والردهه", "الجفنيه", "الحارة الغربية", "الحجره", "الحجره", "الحجناوي", 
    "الحفريه", "الحفنه", "الحقباء", "الحماده ومزارعها", "الحمليه", "الحميمه شرق الجفن", 
    "الحنينه", "الحيسونيه", "الخالديه", "الخبراء والسحابين", "الخرشاء", "الخرماء الجنوبية", 
    "الخرماءالشماليه", "الخشيبي", "الخطيم", "الخفيات وتشمل حاره العنوز", "الخنقة ومزارعها", 
    "الخنقه", "الداث", "الداره", "الدحلة ومزارعها", "الدحله", "الدعيسه", "الدغمانيات", 
    "الدليميه", "الدوادمي - الغيدانيه", "الدوحة", "الديرية", "الديريه", "الذيبيه", 
    "الرئيسيه والصالحيه", "الربقيه", "الربيعيه", "الربيق", "الرحيميه", "الرديفه", 
    "الرس", "الرس - الخريشاء", "الرس - الرفايع ومزارعها", "الرسيس", "الرضم", 
    "الرفايع النجج", "الرفايع والطرفيه", "الرفيعه", "الرفيعه", "الرفيعه ومزارعها", 
    "الركنه", "الركيبينه", "الركيه", "الرمثيه", "الرمحيه", "الروابي", "الروضة", 
    "الروضتين", "الروضه", "الروغانى", "الرويضه", "الزلفي - البرود", "الزهيريه", 
    "الساروت", "السحابين", "السعيره", "السليبه القاهرة", "السليسيه", "السمراء", 
    "السميراء", "السويدة", "السيح", "السيح والحجازيه", "السيق", "الشباكيه", 
    "الشبيكيه", "الشركة العربية لتنمية الثروة الحيوانية", "الشعيفانيه", "الشغيفا", 
    "الشقه العليا", "الشماسيه", "الشمطاء", "الشنانه", "الشهباء", "الشهيباء", 
    "الشيحيه", "الصالحيه", "الصالحيه", "الصبيحي", "الصحاف", "الصقره", "الصلبيه القديمة", 
    "الصليبي", "الصمعوريه", "الصويتيه", "الصيديه", "الضبعيه", "الضلفعه", "الضيدان", 
    "الطرفاوي", "الطرفية الشرقية", "الطرفيه الغربيه", "الطلعة ومزارعها", "الطوال", 
    "الطويله", "الظاهريه الجنوبيه", "الظفيري", "العازميه", "العاقر", "العاقول", 
    "العاموده", "العاير الجنوبى", "العاير الشمالى", "العبدليـة", "العبيله", "العرداء", 
    "العريفيه", "العقيلات", "العقيلة ومزارعها", "العمار", "العماش", "العماير", 
    "العموده", "العموده الشماليه والجنوبيه", "العوشزيه", "العويرض", "الغبيه", 
    "الغضياء والسلمات", "الغماس", "الفايزية", "الفرعه", "الفلخ", "الفواره", "الفويلق", 
    "الفيضه", "القاعيه", "القحصاء", "القرائن", "القرعاء", "القرين", "القعريه", 
    "القليب", "القهيبيه", "القواره", "القوعي", "القويعيه", "القيصومه", "الكدادية", 
    "اللغفيه", "المحبر ومزارعها", "المحلانى", "المحوى", "المخرم", "المدرج", 
    "المذنب", "المذنب - الثامريه", "المذنب - السمار", "المذنب - ساموده", "المذنب - فرده", 
    "المربع", "المرموثه", "المرموثه الشماليه", "المشنيه", "المصك", "المطيه", 
    "المطيوي", "المطيوي الشمالي", "المفرق وكمب الطرق", "المفيض", "المكيلي", "الملقاء", 
    "المليداء", "المندسه", "المنسى", "المهاش المحمديه", "الموشم", "المويه", "الميليح", 
    "الناصريه", "الناصفه", "الناعمه", "النبقيه", "النبهانية - الحماده", "النبهانية - الخريشاء", 
    "النبهانية - الظاهريه", "النبهانية - الوسق", "النبهانية - ساموده", "النبهانية - فرده", 
    "النبهانية - مشرفه", "النبهانية - مهيضه", "النبهانيه", "النجبة", "النخلات", 
    "النخيلة", "النفيد", "النقره", "النقع", "النمريه", "النومانيه", "النويصفه", 
    "الهبيريه", "الهبيريه والجريد الشمالي", "الهلاليه", "الهمجة", "الهمجه", "الهميليه", 
    "الهواويه", "الوسيطاء", "الوضيم", "ام ارطى", "ام الخراسع", "ام العراد", "ام برقه", 
    "ام حزم", "ام سدرة", "ام سلم", "ام سلمه", "ام صحون", "ام صفا", "ام صفيح", 
    "ام طليحه", "ام طليحه", "ام عميـر", "ام غلس", "ام قبيع", "امارة منطقة القصيم - الثامريه", 
    "امارة منطقة القصيم - الحماده", "امارة منطقة القصيم - الرفايع ومزارعها", "امارة منطقة القصيم - الطراق", 
    "امباري", "امهات الذيابه", "اوثال", "باينه", "بدائع الحمائين", "بدائع الردافين", 
    "بدائع الضبطان", "بدائع الضبعيه", "بدائع ريمان الشمالي", "بدايع اللهيب", "بدره وام خط", 
    "بدينه", "بريده", "بقيعاء الجنوبيه", "بلدة مشرف", "بلعوم", "بليعيم", "تلعه رشيد", 
    "ثادج", "ثويدج", "جحيره", "جدعاء", "جديد", "جريثم", "جفره", "حريفيات درعه", 
    "حله سعيدان", "حليسه ومزارعها", "حليوه", "حماده الترمس", "حماده بن مجلا", 
    "حماده حسلاء", "حماده نجخ الشمالي", "حنيظل", "حي الجامعية", "خب الحلوه", 
    "خب الكيفه", "خب روضان", "خبه الدخول", "خريمان الاشقر", "خريمان الشمالي", 
    "خشيبى الحضر القديم", "خصيبه", "خضراء", "دارة عكاش", "دخنه", "دريميحه", 
    "دريميحه الشماليه", "دهيماء الجديده", "دهيماء القديمه", "دوبح", "ديم", 
    "ذو عواض بن ديحان الحيسوني", "ذوقان الركايا", "ذوي مازن صعيقر الحيسوني", 
    "رشيده", "رفايع الحجره", "رفايع الحميمه", "رفايع الصمعوريه", "رفايع اللهيب", 
    "رفايع النقرة", "ركدان", "روض الجواء", "روضة الحزم", "روضه الحسو", "روضه ريمان", 
    "رياض الخبراء", "رياض الخبراء - العلياء", "ساق", "سبيله", "سدحه", "سلام", 
    "سمحه ومزارعها", "سويقه", "شرى", "شطنا", "شعب الحمر", "شعب الداره", "شقراء", 
    "شقران الحاجر", "شقران الخيمه", "صالح هلال", "صبيح", "صعينين", "صميعر", 
    "صيادات ومزارعها", "ضراس", "ضرية - الظاهريه", "ضريه", "ضليع رشيد", "ضمينه", 
    "ضيده", "طخفه", "طراق ضيده الغربى", "طراق ضيده الغربى", "طريف", "طفيله", 
    "طوال جبيره", "عريفجان ساحوق", "عزيزه الترمس", "عسيله", "عطاء", "عطي", 
    "عقلة الصقور - الوسق", "عقلة الصقور - مهيضه", "عقله الصقور", "علباء", 
    "علباء القديمة", "عماير عقاب", "عنيزه", "عويسة", "عيده", "عين بن فهيد", 
    "عيون الجواء", "عيون الجواء - مشرفه", "غاف الجواء", "غراب", "غضى", "فياض طلحة", 
    "فياضه", "فياضه ومزارعها", "فيضة الداره", "فيضة دخنه", "فيضة ضليع رشيد", 
    "فيضة يكلب", "فيضه الريشيه", "فيضه السلمات", "فيضه الشعب", "فيضه بن حميد", 
    "فيضه ذيبان", "فيضه ساحوق", "قبه", "قراضيه", "قريطه", "قريه ومزارع ابو حمرة", 
    "قصرابن عقيل", "قصرالبطاح العلوات", "قصيباء الجديده", "قلبان الشيبانيه", 
    "قليب الترمس", "قليب بن عفير", "كبد", "كحله", "كسارات الذيبيه", "كسارات عنيزه", 
    "كفت", "كمب بن لادن", "كمب شوفان", "ليم", "مازونة", "مبهل", "محامة الهجره", 
    "محرقاء", "محطه ابن معيلى", "محطه ساسكو", "محير الترمس", "محيوة", "مخيط", 
    "مرغان", "مزارع أبا الورود الشرقية", "مزارع ابا الورود الغربية", "مزارع الابتر", 
    "مزارع الاجردى", "مزارع البدع", "مزارع البكيريه الشماليه", "مزارع البندريه", 
    "مزارع الجفن والردهة", "مزارع الخبة", "مزارع الخبراء الشماليه", "مزارع الخرما الشماليه الغربية", 
    "مزارع الخرماء الجنوبيه", "مزارع الخريشاء", "مزارع الدحله", "مزارع الرحيميه", 
    "مزارع الروض (الغربية والجنوبية)", "مزارع الروضه", "مزارع السمار", "مزارع السيح والحجازيه", 
    "مزارع الشعيب", "مزارع الشفاء", "مزارع الشيحيه", "مزارع الصعيقريه", "مزارع الصلبيه الجنوبيه", 
    "مزارع الطراق الجنوبية", "مزارع الطراق الشرقية", "مزارع العمار", "مزارع العيون طريق بريده", 
    "مزارع الغاف الشماليه الشرقيه", "مزارع الفويلق", "مزارع الفيضة", "مزارع القطع", 
    "مزارع القوارة الجنوبية والشرقية", "مزارع القوارة الشمالية والغربية", "مزارع القوعي", 
    "مزارع المخرم الشرقيه (اعيوجات)", "مزارع المخرم الغربية", "مزارع المدرج الجنوبيه", 
    "مزارع المدرج الشماليه", "مزارع المدرج الغربيه", "مزارع المربع", "مزارع المطيه", 
    "مزارع المطيوي", "مزارع النجبة", "مزارع الوديات", "مزارع الوسيطاء", "مزارع ام الرضمه", 
    "مزارع ام المحاش", "مزارع اوثال", "مزارع بهجه", "مزارع ثريان", "مزارع جنوب المدينة والبربك", 
    "مزارع جنوب غرب البدائع", "مزارع جنوب قبه", "مزارع جنوب قصيباء", "مزارع خريمان الجنوبى", 
    "مزارع خصيبه", "مزارع خناصر", "مزارع دريميحه", "مزارع روضه الحسو", "مزارع ساق", 
    "مزارع ساموده السمار", "مزارع شرق البطين", "مزارع شمال الطرفيه", "مزارع شمال المحير", 
    "مزارع شمال قصيباء", "مزارع طلابة", "مزارع عسيله", "مزارع عشيرة", "مزارع علباء", 
    "مزارع عنز", "مزارع غرب المحير", "مزارع غرب ام حزم", "مزارع فيضة دخنه", 
    "مزارع قصر ابن عقيل", "مزارع قطن", "مزارع كبد", "مزارع كير", "مزارع نفجه", 
    "مسكه", "مشاش جرود", "مشاش ركيان", "مشرفة", "مشرفة ريمان", "مشرفه عمودان", 
    "مشروع الراجحي", "مطربه", "مطيوى", "مظيفير", "مفرق الشبيكيه", "مقطع صاره", 
    "ملحه", "ناصفة ابان الاحمر", "ناضره ام ثميد", "نبيها والشنانة", "نجخ الجنوبي", 
    "نقره الردافين", "هجره عسيلان", "هرمول", "هرموله", "هويشله", "وادي ابوعلي", 
    "وادي الجناح", "وادي النخيل", "وادي النعم", "الحي", "إختر الحي"
]

cities_7th = [
    "آبار البدايع", "آبار الخبره", "آبار الطويرفه", "آبار العثيا (العثيمه)", "آبار النخلات", "آبار ضاحك", "آبار قصب", "آبار مصلح", 
    "آلاب", "آيله", "أبار حرة الخلاصات", "أم الحسينات (القطار)", "أم الرجوم", "أم الطبقان", "أم الظبا", "أم فحوين", "أم فرق", 
    "أنميا", "إسكان الأمير سلطان بن عبدالعزيز الخيري", "إسكان شركة روكي", "ابا الجلود", "اباالبقر", "اباالحامض", "اباالعريج", 
    "اباانعم", "ابار ابا الدود", "ابار ابن حصانى", "ابار ابو عشره", "ابار الحفاير", "ابار الخفيق", "ابار الرداده", "ابار الرشا", 
    "ابار السنويه", "ابار الصروم", "ابار العبيري", "ابار العطيشانه", "ابار العمود", "ابار الفارعه", "ابار الفريد", "ابار القنينى", 
    "ابار الكرار", "ابار الماشي", "ابار المايين", "ابار المجيرمه", "ابار النابع", "ابار النجليه", "ابار الهنديه", "ابار ام رتق", 
    "ابار حلقه (حلقه الغاير)", "ابار حميد", "ابار طرفان", "ابار عايش", "ابار عذبة", "ابار عشيره", "ابار عطيه مناور", 
    "ابار على الاحمدى (الضفيره)", "ابار عيد", "ابار غنيم بن سالم", "ابار منيه", "ابار نصيف", "ابار وتر", "ابقريه", "ابو بريقا", 
    "ابو حبل", "ابو حليفه", "ابو خرجين", "ابو رويضة قرية الجراجره وابن سودان", "ابو زباير (العين)", "ابو زبيره", "ابو زرائب", 
    "ابو ضباع", "ابو طينه", "ابو عشعوش", "ابو غشاه (ام المملح)", "ابو لصب", "ابو مغير", "ابو نجم والمحاوشيه", "ابو هشيم", 
    "ابو هشيمات", "ابوحرامل", "ابورويث", "ابوطلحه", "ابيار المصنوع", "ابيار النجل", "ابيار رحاب", "ابيار ندياء", 
    "اثره السفلى (حارة الصربان)", "اثره العليا", "اجمار", "احر", "اردعي", "اركه", "اسلام", "افق", "افه", "الأبيض", 
    "الأسلق (العزيزيه)", "الأوجر", "الابرق", "الابرقين", "الاثود الشرقيه (العليا)", "الاثود الغربيه (السفلى - الدقيقه)", 
    "الاحمر", "الاريفح", "الاشقر", "الاصيحر", "الاصيحر الغربى", "الاكحل", "الانثى (العقده)", "الايثبه", "البثنه", "البحره", 
    "البحيره", "البختيه", "البدنه", "البديع حاكم", "البديع الرياشى", "البديعه", "البراقية", "البراقيه", "البرث", "البرديه", 
    "البرك", "البركه", "البريكه", "البستان", "البقاريه (الفرعه)", "البقاع الفرعه (البلدة)", "البقعيه", "البلاطه", "البلاليه", 
    "البلي", "البلينية", "البهميه (الشباريه)", "البوادي", "البوير", "البويرات (بروات)", "البويرة", "البويطن", "البييرات", 
    "التجرة", "الثبره و دريبس", "الثعلة", "الثعيلبان", "الثمائل", "الثمامى", "الثماميه", "الثمد", "الجابريه", "الجحفه", 
    "الجديد", "الجديده", "الجذوع", "الجذيبة", "الجرذاوي", "الجرم", "الجرنافه", "الجريسيه", "الجصه", "الجصه العليا", 
    "الجضعاء", "الجغدور", "الجفر", "الجلبه", "الجم", "الجماجمية", "الجميزة", "الجهيانه", "الجوابره", "الجياسر", "الحار", 
    "الحارش", "الحاسمه وشبيرم", "الحاقنة", "الحامديه", "الحبابيه", "الحجر (مدائن صالح)", "الحجريه", "الحجنه", "الحديقه", 
    "الحرضه", "الحزره", "الحزيزه", "الحزيمي (غدير)", "الحسك", "الحسو", "الحسي", "الحسيات", "الحسينيه", "الحصاة(حصان الداب)", 
    "الحصانه", "الحصحاص", "الحفاه", "الحفره", "الحفى", "الحفياء", "الحلبة", "الحلحال", "الحلقة", "الحمأ", "الحمادة", 
    "الحمدانية", "الحمراء", "الحمنه (المزرع)", "الحمه", "الحميدانى", "الحميضة", "الحميضه", "الحميط", "الحناكية - السليم", 
    "الحناكية - الصمد", "الحناكية - العقيله", "الحناكية - المسبعة", "الحناكية - ام شكاعه", "الحناكية - سويقه", "الحناكية - غراب", 
    "الحناكيه", "الحنو", "الحومه", "الحويل", "الحويمضه", "الحيل المحاجر (مشرفه)", "الخراره", "الخراوع", "الخرقه", "الخرماء", 
    "الخريبه", "الخريم", "الخشيبه", "الخشيرمه", "الخضراء", "الخطيه", "الخفيق", "الخلصاء", "الخلصه", "الخنقة (البريم)", 
    "الخياطيه", "الخيال", "الخيامية الشماليه", "الخياميه الجنوبيه", "الداره", "الدبه", "الدحو", "الدحوه", "الدحيله", "الدعب", 
    "الدعكه", "الدغـر", "الدف", "الدقم", "الدقيقه", "الدمثية", "الدهماء", "الدوداء", "الدوداء تناضب", "الدويفعه", "الدير", 
    "الديوانيه", "الذبال", "الراء", "الراحه", "الراشديه", "الراغيه", "الرايس", "الرايغه", "الرباعيه (الربيعيه)", "الربض", 
    "الرتاجه", "الرتج", "الرجع", "الرجع (الحزيمه)", "الرجل", "الرحبه", "الرديدة", "الرذايا", "الرصفاء", "الرغيبه", "الرفائع", 
    "الرفايع", "الرفيحاء", "الرفيعة", "الرفيعه", "الرفيف المجرمه", "الرقابيه", "الرقب", "الرقبه", "الرقيبه", "الركنة", 
    "الرمثيه", "الرمضه", "الروزه", "الروى", "الرويضه", "الريان", "الزابنية", "الزاحميه", "الزباد", "الزباير", "الزباير الحديثة", 
    "الزبيديه", "الزبيرة", "الزراعيه", "الزرب", "الزغبا", "الزغر", "الساده (آبار الساده)", "السالمية", "السايله", "السبعانه", 
    "السدارة", "السدر", "السدره", "السده", "السدير", "السديرة", "السديره", "السراقي", "السرحيه", "السريحه", "السريحية", 
    "السطيح", "السعدان", "السفح", "السقيفه", "السكبيه الدقيقه", "السكوبية", "السليله", "السليله القديمه", "السليم", 
    "السليمي", "السليميه", "السمره", "السميراء", "السمينيه", "السناء", "السنفاء", "السنويه", "السنيان", "السنيف", "السهله", 
    "السوسيه", "السوق", "السويرقيه", "الشامانية", "الشبرميه (الشبرم)", "الشراعبه", "الشرجه", "الشريق الشرقي", "الشعابه", 
    "الشعاله", "الشعبه الجنوبيه", "الشعبه الشماليه (ام الحماط)", "الشعيبه", "الشعيبين", "الشقران", "الشقرة", "الشقيراء", 
    "الشلايل", "الشمسه", "الشوامين", "الصابرية", "الصادره", "الصالحيه", "الصحيراء", "الصخرة", "الصديفاء", "الصعبيه", 
    "الصفصف", "الصفق", "الصفي", "الصفيحه", "الصلحانيه", "الصلصله", "الصلصله القديمه", "الصميد", "الصميما", "الصميماء", 
    "الصميمة", "الصويدره", "الضاينه", "الضبعيه", "الضرسية", "الضليعه", "الضليل", "الضمو", "الضميريه", "الضويله", "الطرطحيه", 
    "الطرقيه", "الطفيان", "الطويلة", "الطيار", "الطيبة", "الظاهرية", "الظلل", "الظما", "العاقر واشك", "العاليه", "العامرى فم عرفه", 
    "العبايش", "العبيد", "العبيله (ريان)", "العثياء", "العد", "العدله", "العذاب", "العذيب", "العرائد", "العرف", "العريده", 
    "العريفي", "العساف", "العشاش", "العشاي", "العشيره", "العشيش", "العصيليب", "العضيرسة", "العضيلية", "العطافية", "العطشان", 
    "العفيره", "العقبه", "العقيلة", "العقيله", "العلا", "العلا - السدره", "العلا - اللحيان", "العلا - النجيل", "العلقميه", 
    "العلم", "العماير", "العمق", "العمور", "العميد ابو سهلة", "العميق", "العميقه", "العوشزى", "العويقل صماخ", "العويند", 
    "العوينه", "العيزة", "العيص", "العيص - السليميه", "العيص - الفيضه", "العيص - بئر حسن", "العيص - حريمل", "العيص - دمدم", 
    "العين", "العين الجديده", "العين القديمه", "العيينه", "الغاشيه", "الغريض", "الغزلان", "الغزلاني", "الغزيل", "الغصين", 
    "الغضن", "الغمر", "الغور", "الغويشيه", "الفارع", "الفراش", "الفراشة", "الفرش", "الفرشه", "الفرضوخيه", "الفرع", "الفرعيه", 
    "الفريدة (المبروكة)", "الفريش", "الفريعه", "الفشغات", "الفعره (العقله)", "الفقرة", "الفقعلي", "الفقير", "الفلقه", 
    "القافله", "القبقابه", "القبوريه", "القبيبه", "القبيه", "القديره", "القراصه", "القرص", "القرن", "القريه", "القزاز", 
    "القصوريه", "القصيبة", "القطار", "القعره", "القلب", "القويعيه", "القيم", "الكانية", "الكراع", "الكويره", "اللحن", 
    "اللحيان", "اللحيج", "اللصيفه", "اللطيه", "اللق", "اللهبان", "الماتيه", "الماويه", "المبارك", "المتفاشق", "المتنه", 
    "المثلث", "المثلث ومركز المرور", "المثنى", "المثوبه", "المجادلية", "المجامع", "المجرذيه", "المجمعة", "المجمعه", 
    "المجيسير", "المحامه", "المحتجبه", "المحتجبه ( ذات الركب)", "المحضه", "المحفر", "المحم", "المحمدية", "المخباه العليا", 
    "المخروقه الجنوبيه", "المخروقه الشماليه", "المخيبيه", "المدراء", "المديرا", "المديسيس", "المدينه المنوره", "المراميه", 
    "المربع", "المربوكه", "المرتجه", "المرداسية", "المرغه (الثانيه)", "المرغه الأولى", "المرقاب", "المرموثه", "المرمى", 
    "المروه", "المرير", "المريه", "المزاحمية", "المزرع (اليبس)", "المزرع (شنقب)", "المزرعه", "المساوق", "المسبعة", 
    "المسجد", "المسره", "المسيجيد", "المسيربيه", "المشاش", "المشانيه (الممشينيه)", "المصينع", "المضاويح", "المضبر", 
    "المضيبعة", "المضيبعه", "المضيح", "المضيق", "المطاوى", "المطين", "المعتدل", "المعدن", "المعيرج", "المغدار", "المغرة", 
    "المفرحات", "المفرق", "المفرق (محطة التوحيد)", "المفرق المثلث", "المقرح", "المقرن", "المكتب", "المكيمل", "الملبنه", 
    "الملحا (ملحاالشوافعة)", "الملحة", "الملحه", "الملسن", "الملقا", "المليليح", "المنبعج", "المنتزهه", "المنجور", "المنجي", 
    "المندسة", "المندسه", "المنشار", "المنصاء", "المنصة", "المنقا", "المنهاه", "المهد - الجميماء", "المهد - الحفيره", 
    "المهد - السدره", "المهد - السليم", "المهد - العقيله", "المهد - الفيضه", "المهد - المصلى", "المهد - الملحه", 
    "المهد - ام شكاعه", "المهد - سمر", "الموارد", "المواريد", "الموسمية", "المويرده", "المويلح", "المويه", "المويهيه", 
    "النابع", "النازية", "الناصبيه", "الناصفه", "الناطف", "الناعمة", "النباة", "النباعه", "النبعه", "النبيعيه", "النجف", 
    "النجل", "النجيريه", "النحيته", "النخير", "النخيل القديم", "النشج السوسيه", "النعام", "النعضه", "النعمانيه", "النعيريه", 
    "النعيمه", "النغير", "النغيرات", "النفازى", "النقويه", "النقيب", "النقيبين", "النقيعاء", "النهبة", "النهضة", "النوره", 
    "النويبع", "النويبع والنابع", "الهدى", "الهديدة", "الهراره", "الهلالية", "الهمجة", "الهميج", "الهميجه", "الهنديه", 
    "الهويمليه", "الوادى", "الواديين (ابوشكير)", "الواسطه", "الواضح", "الواضح بشيبان", "الوايلية", "الوجيده", "الودي", 
    "الورد", "الوزب", "الوسطه", "الوسيطاء", "الوفض", "الوقيعة", "الولجه", "اليتمة", "اليراكه", "اليوسفيه", "ام البرك", 
    "ام الحدج", "ام الحيران", "ام الدمار", "ام الرجوم", "ام السدر", "ام السلم", "ام السمر", "ام الصعانين", "ام العراد", 
    "ام العوشز", "ام العيال", "ام الغيران", "ام المدابغ", "ام الوهم", "ام رضم", "ام رنيفات", "ام زرب", "ام سراح", "ام سليمات", 
    "ام سيال", "ام شجيرات", "ام شعره", "ام صور", "ام ضعيات", "ام طليحه", "ام عبس", "ام قويع", "ام لحيين", "ام هدم", "ام هشيم", 
    "ام وقيبات", "امارة منطقة المدينة المنورة - الرميده", "امارة منطقة المدينة المنورة - الملحه", "امهات بيبض", "امول", 
    "اميره", "انبوان", "انبيع", "اويدك", "بئر ابن عبدالله", "بئر ابن عمري", "بئر ابن كامل", "بئر ابو جنيب", "بئر ابو حصاه", 
    "بئر ابو سرحه", "بئر ابو عبيده", "بئر ابوقرنين (خظيراء)", "بئر اثفا", "بئر اثمد", "بئر احمد", "بئر احمد الكلبي", "بئر ارطاه", 
    "بئر اريكة", "بئر الابرقية", "بئر الاراك", "بئر الازير", "بئر البخي", "بئر البديع (البديع القديم)", "بئر البريمه", 
    "بئر الترهوه", "بئر الثمد", "بئر الجبيل (الردائف)", "بئر الجبيلة", "بئر الجويات", "بئر الجيف", "بئر الحربي", "بئر الحرجه", 
    "بئر الحسنه", "بئر الحفيره", "بئر الحفيريه", "بئر الحما (هجر الحما)", "بئر الحوازم", "بئر الخربه", "بئر الخضيراء", 
    "بئر الخضيري", "بئر الخنقه", "بئر الداهن", "بئر الدمثه", "بئر الراية", "بئر الرتق", "بئر الرتيق", "بئر الرحيلى", 
    "بئر الردهة", "بئر الرديهيه", "بئر الرصيصه", "بئر الرصيفة", "بئر الرفيعي", "بئر الروحاء", "بئر الروضه", "بئر الرويضه", 
    "بئر الزريديم", "بئر الزعفرانه", "بئر الزنيهر", "بئر الساهبه", "بئر السديره", "بئر السري", "بئر الشبولي", "بئر الشرقى", 
    "بئر الشريوفي", "بئر الشقيمة", "بئر الشيخ", "بئر الشيخ أحمد الخطاب", "بئر الصائغ", "بئر الصبخيه", "بئر الصفاء", 
    "بئر الصفينيه", "بئر الضمو", "بئر الظمو", "بئر العبد", "بئر العرفه", "بئر العروى", "بئر العلق", "بئر العلونى", 
    "بئر العيز (الحلقات)", "بئر الغنم", "بئر الغوقه", "بئر الفارعه", "بئر الفحيج (الفحيجيه)", "بئر الفقير عيال رشدان", 
    "بئر الفليق", "بئر القاضي", "بئر القرصه", "بئر القمعه", "بئر اللحاء", "بئر اللحويه", "بئر اللحى", "بئر اللقيحيه", 
    "بئر المالح", "بئر الماويه", "بئر المجيرمه", "بئر المحتوت", "بئر المزرعة", "بئر المزيرية", "بئر المزيني", "بئر المسمى", 
    "بئر المشاعليه", "بئر المشروع", "بئر المشيريف", "بئر المغيسليه", "بئر المقراة", "بئر المقفاه", "بئر الميراد كتيفه", 
    "بئر النجيل (النجيفه)", "بئر النخيله", "بئر النمله", "بئر الهيم", "بئر الوبره", "بئر ام السوانى", "بئر ام هشيم", 
    "بئر بخيت", "بئر بخيت الصاعدي", "بئر بخيت بن غانم", "بئر بن جبر", "بئر بن رشيد", "بئر بن زويد", "بئر بن سلطان", 
    "بئر بن فهيد", "بئر بن معنز", "بئر بنى درويش", "بئر بواط", "بئر جابر (رينه)", "بئر جابر بن جباره", "بئر جاسر", 
    "بئر جامره", "بئر جمعان", "بئر جميع", "بئر حاسن بن محمد", "بئر حامد العمراني", "بئر حامد بن رجا", "بئر حجيجه", 
    "بئر حضيض", "بئر حطيحط", "بئر حمادى", "بئر حمد المشاش", "بئر حمد بن فرز", "بئر حمد مطلق", "بئر حمدان", "بئر حمدان بن سليمان", 
    "بئر حمدي بن عواده", "بئر حميد", "بئر حميد حميدان", "بئر حميراء", "بئر حويمد المريشدي", "بئر خرص", "بئر خليل", 
    "بئر خير الله", "بئر دخيل الله", "بئر دماسه", "بئر رابح الرحيلي", "بئر راشد", "بئر رايق", "بئر ربيع", "بئر رجا معلا", 
    "بئر رجاالله بن فرج الله", "بئر رحيب بن طلق", "بئر رشيد المرش", "بئر رشيد بن محمد", "بئر ركك", "بئر رنه", "بئر رويشد", 
    "بئر زابن", "بئر زاكي", "بئر زريبه (زبيدة)", "بئر زهيميل", "بئر سافر", "بئر سالم بن ثابت", "بئر سالم مفرج", "بئر سبيع", 
    "بئر سحاله", "بئر سعد", "بئر سعد بن عبدالله", "بئر سعد بن عيد", "بئر سعد بن مسعد", "بئر سعيد عواد", "بئر سقما (النقره)", 
    "بئر سلم (الصالحية)", "بئر سليم", "بئر سليمان", "بئر سمران", "بئر سمرين", "بئر سمير", "بئر سواميد", "بئر شاهر", 
    "بئر شايد السحيم", "بئر شديد", "بئر شرام", "بئر شليه", "بئر صابر", "بئر صالح", "بئر صالح الرفاعي", "بئر صالح بن حماد", 
    "بئر صالح محمد", "بئر صايل", "بئر صبر ربيع", "بئر صغير", "بئر صلاح", "بئر طايل عتيق الحربي", "بئر ظمن بن سليم", 
    "بئر عايد", "بئر عايد العنمي", "بئر عايش", "بئر عباد", "بئر عبدالعزيز بن عودة", "بئر عبدالله", "بئر عبدالله الحسيني", 
    "بئر عبدالله قاسم", "بئر عتقه الميلبي", "بئر عتيق السريحي", "بئر عجيل", "بئر عرفان", "بئر عطاالله", "بئر عقيل (ام سدره)", 
    "بئر علي", "بئر علي بخيت", "بئر عمر", "بئر عنزا", "بئر عوده (الرجبي)", "بئر عوده بن حسين", "بئر عوض", "بئر عويد الكتيني", 
    "بئر عويد بن حميدان", "بئر عويد بن سليمان", "بئر عويش الحازمي", "بئر عياد الردادي", "بئر عيال سلمان", "بئر عيال سليم", 
    "بئر عيال عياش", "بئر عيد", "بئر غيث", "بئر فارس", "بئر فالح", "بئر فالح الزغير", "بئر فايز", "بئر فراج الحازمي", 
    "بئر فريج", "بئر فواز بن غالى", "بئر فويز", "بئر قعيقعان", "بئر قنيع", "بئر قوزه", "بئر قيضي", "بئر كبر", "بئر كريدم", 
    "بئر لويه", "بئر ماضى القفاف", "بئر ماطر الغذي (المارده)", "بئر مبارك بريك", "بئر مبرك", "بئر مبروك بن سفر", "بئر محارب", 
    "بئر محسن بن احمد", "بئر محمد بن رويعى", "بئر محمد سعيد", "بئر محمد سليم", "بئر محمد صالح (أم فحي)", "بئر محمد غانم", 
    "بئر مراخ", "بئر مران", "بئر مرشد الكشي", "بئر مرشد بن رويشد (الكباشية)", "بئر مرشد عطية سليمان", "بئر مريخة", 
    "بئر مريزيق بن عواد الخضري", "بئر مساعد", "بئر مساعد الحازمي", "بئر مساعد جليدان", "بئر مسعد", "بئر مسعف الذكره", 
    "بئر مسعود", "بئر مسلم", "بئر مسيب", "بئر معتاد بن ربيعان", "بئر معوض الرحيلي", "بئر معيتق", "بئر مغطه", 
    "بئر مفرج واصل القرافي", "بئر مقحم القويره(فارس)", "بئر ملحاء", "بئر ملوغ", "بئر مليحه", "بئر منسى", "بئر ناجي", 
    "بئر ناصر (الصميده والدحيل)", "بئر نافع الجلوي", "بئر نخر", "بئر نغيمش", "بئر نما السريحي", "بئر نويجع", "بئر نويحي بن سعد", 
    "بئر نويمى", "بئر هديهد", "بئر هندى", "بئر وادى البيار", "بئر وزير الرفاعى (الذيبيه)", "بئر وصل", "بئر وقيت العبيدي", 
    "بئر يحيى بن عواد", "بئرالحلوه", "بئرالسديد", "بئرخصلف", "بئرسلم", "بئرعبده", "بئركتان", "بئرمحمد المطلق", 
    "بئرهليل بن محمد", "باديه الصعيب", "باديه بيضان (الحسك)", "باديه وادى الحمى", "بحيرة سعيدة", "بخيت", "بدائع الحناحنه", 
    "بدائع العوض", "بدائع الكوم", "بدائع ساق", "بدائع مشرفة", "بدر", "بدر - السليميه", "بدر - الشفيه", "بدر - الفارعه", 
    "بدر - المعيزله", "بدر - بئر حسن", "بدر - بئر سلامه", "بدر - تناضب", "بدر - دمدم", "بدر - سمر", "برقه", "بركه ابو مغيره (الربثه)", 
    "برمه", "بريده", "بريريق", "بشير بن محسن", "بطحى", "بغوه", "بلغه", "بلوده", "بليغه", "بهمان (نزلة الشيخ صادق)", 
    "بيئرالعلاويه", "بيار راين", "بيداء سباح", "بير ابا الحلو", "بير الضريبانية", "بير العبيري", "بير عبد الله الحنو الرفاعي", 
    "بير معلا", "ترجم الترعه", "ترعة", "تفيدة", "تلعة مسلم", "تلعه نزه", "تنضب", "تومل", "تيتد", "ثرب", "ثربه", "ثعيل", 
    "ثمايل ضاس", "ثمره", "ثور", "جابر بن ناجى", "جبل الكويره", "جثيوث", "جدعاء", "جراب", "جراجر", "جرول", "جري", 
    "جزع البويانات", "جملاء (موارد مياه )", "جميما الشعبة", "جيده", "جيله", "حاذه", "حارة المراشده (المضييق)", 
    "حارة عطا الله حويمد المرشدي", "حاره ام العشم", "حازم والشريفه", "حامد مطلق", "حرة رهط", "حزره", "حلاوه", "حمرة رشاد", 
    "حنذ", "حي الرحاب", "حي السيح", "حي السيف", "حي بن جامع", "خبراء محمد", "خذوه", "خران وام جيش", "خرجا", "خضرانه", 
    "خضره", "خنقة المزرع", "خيبر", "خيبر - الجرف", "خيبر - الحفيره", "خيبر - السليم", "خيبر - الشفيه", "خيبر - سويقة", 
    "خيط الفضله", "خيف الحزامى", "خيف الكسا", "خيف ام ذيان", "خيف حسين", "دانه", "دحلة الفاطر", "دحموله", "دعامه", 
    "دعب السقو", "دعيب حمدي", "دغاون", "دغبج", "دف الرفحة", "دف رحال", "دمعان", "دواره خلص", "دوريت", "دوينه", 
    "ذات ركيب (سريحان)", "ذاره", "ذوره", "ذيران", "رابغ - بئر سلامه", "ربقى", "رحبة علوش", "رحبه الحسنى", "رحبه الفرس", 
    "رحيه", "رشاد", "رشيدة", "رعل", "رف ثعيل الجنوبي", "ركك وركيك", "رمث المخرف", "رهبا", "رواحه", "روضه الفيفا", "ريام", 
    "ريع الشيابين", "ريمه", "زبران", "زحل", "زرب الخيمه", "زويده", "سدير", "سرار", "سريد الصيد", "سفا", "سقام", "سلم", 
    "سليلة جهينه", "سمار", "سمحة", "سميرة", "سمينان", "سنان الشلول", "سهله المزرع", "سوارق", "سويقه (السافريه)", 
    "شبرقان", "شبرقه", "شثيث", "شجوى", "شخت البحار", "شدان", "شرث", "شرحوط", "شرعان", "شركة المتحده للشعير", 
    "شركة ثروات البحار", "شعب", "شعب زيد", "شعيب الابرقين", "شعيب البرود", "شعيب الحار", "شعيب الحليقه", "شعيب الرديح", 
    "شعيب العطيشانه", "شعيب الغميس", "شعيب المحطة", "شعيب الميراد", "شعيب النخلة", "شعيب الهزم", "شعيب اليماني الشرقي", 
    "شعيب ام رميث", "شعيب انفة", "شعيب بط", "شعيب رباق", "شعيب عرقوص", "شعيب علقه", "شعيب قاسم", "شعيب مثعر", "شعيب مليحه", 
    "شعيب ميراد الثاجه", "شعيب يدوم", "شعيب يسر", "شقر", "شقيم الذيب", "شلال", "شوساء", "صبحا التيسى", "صبحا الجحفه", 
    "صحيفه", "صخوى", "صخيبره", "صدر العنيق", "صفينه", "صمد الارينة", "صمد الصعيد", "صوري", "صوير", "ضاعا", "ضبعان", 
    "ضعه", "ضفيان", "ضمو المهديات", "ضويل", "ضويلان", "طاشا ( حي المدارس )", "طاط", "طرف ظبيه", "طريف الرجل", "طلال", 
    "طلعه الماك", "طيب اسم الجنوب", "ظمو", "عاتق مرزوق", "عارة", "عاصر", "عايض بن حسن", "عبدالله مبروك", "عجلة", "عدان", 
    "عرجا", "عرضاء", "عرعر", "عرفان", "عرفوط", "عرن", "عريد", "عريفجان", "عريق الوبارة", "عسيلة", "عسيله", "عشاش", 
    "عشره", "عصمان", "عضاد", "عقله الصيفي", "عقيربان", "عكاف", "عكبر", "علقه", "على بنيه", "عمير الردادي", "عنم", 
    "عنيزان ابا النعم", "عنيزه", "عورش", "عويجاء", "عويد بن بركه الردادي", "عويشه", "عين العبادله", "عين ام حكيم", 
    "عين طواله", "عين على الحربيه", "عين فليح", "عين وديد", "عييبه", "غانم سليمان", "غراء", "غضن العليا", "غضيره", 
    "غفره", "غمره", "غمير الأخاضرة", "غمير اللبدات (المناصير)", "غمير المواشية", "فرحة السرحي", "فرشه الشامي", "فريضيخ", 
    "فشقه", "فضلا", "فم البيد", "فم الدير", "فم سلام", "فم علقة", "فم عنزاء", "فيد الاسفل", "فيد الاعلى", "فيضة افجيج", 
    "فيضة غازي", "قاع الحاج", "قاع الحماط", "قاع النقيب", "قاع ترك", "قاع جثليه", "قاع حاضا", "قراره", "قراقر", "قران", 
    "قردعه", "قرظه", "قرية النخيلات", "قرية لوي", "قريه الفرعي", "قسبان", "قصب", "قصيب ابو خريط", "قصيب ابو سيال", 
    "قصيب الاعوج", "قصيباء", "قصير عمودان", "قصيره", "قطية", "قعره الدومه", "قميله", "قناوه", "كامب ارامكو", "كتاد", 
    "كتانه", "كتيده", "كتيفه", "كحله", "كعانه", "كمب شركه جبل صايد", "كمب كسارة المردوف", "لايه", "لحج", "لحف", "لقفاء", 
    "لواء", "ماروما", "متان الحب", "مثعر", "مجموعة ابار الغلامية", "مجيراء", "محامة الجنازه (طلال)", "محطة بنزين الجابري", 
    "محطة تحلية المياه", "محطه المدينه المنوره للمحروقات", "محمد بن سعيد", "محينش", "مخضير", "مدسوس", "مديسيس", 
    "مذخره السويرقيه", "مراخ", "مربظاء", "مرشد", "مركز الهجرة", "مريغان", "مزارع ألاب", "مزارع الجصة الجنوبية", 
    "مزارع الحار", "مزارع الرصيعة", "مزارع السليميه", "مزارع السواس", "مزارع الشفيه", "مزارع القفيف", "مزارع القلطه (المضيق)", 
    "مزارع القويز", "مزارع جبال الاجرد", "مزارع جبال صبح", "مزارع خشم الحمراء", "مزارع خيف الحزامي", "مزارع شعيب الفرع", 
    "مزارع عباثر", "مزارع عرفوط والقاحة", "مزارع قاع المدر", "مزارع مسيل السليم", "مزارع وادى البعيث", "مزارع وادي الدثير", 
    "مزارع وادي النخل", "مزارع وادي اليتمة", "مزاع السدر", "مزراع عفاتر", "مزرعة ابراهيم سلمان", "مزرعة الشريف", 
    "مزرعة حمد العضب", "مزرعة محمد دخيل الله الذبياني", "مزرعه الاحيوى", "مزرعه بخيت بن ناصر", "مزرعه جديد شرعان البلوي", 
    "مزرعه عبدالله الزرق", "مزرعه عبدالله غويطان البلوي", "مزرعه عبيد مسعود", "مزرعه علي محيا", "مزرعه مسفر (بئر مسفر)", 
    "مسحوما", "مسلم بن تركي", "مسيطح", "مشاش الكراوين", "مشاش بن نماي", "مشحيد", "مشوقه", "مشيط", 
    "مشيط قرية الجفافيل والشوافعه", "مصادر", "مصلح الرحيلي", "مصنع الاسمنت", "مضره", "معذبه", "مغيراء", "مغيسل", 
    "مغيطه", "مفرق الرايس", "مفيتيلات", "مقطع الرحى", "مقيرح الشرارات", "مقيلات", "ملاح اللحن", "ملح", "ملح الصفيحه", 
    "ملل", "مليح", "مليحا", "ممناة", "منازل وادي ظلامه", "منجم شركة اسك", "منصور بن حطيحط", "مهد الذهب", "ناجي بن عوده", 
    "نبط", "نجار", "نخل مسرح", "نخل مغور", "نديفة", "نزله ابو حواء", "نزله البحره (الصمد الاخضر)", "نزله الحميمه", 
    "نزله الصمد", "نزله الصواعد", "نزله بشير", "نزله ربيع", "نزله سليمان بن سالم", "نزله عامر بن عمران", "نزله عباس بن عساف", 
    "نزله عبدالله الرتوعي", "نزله محمد على بن عساف", "نزله نافع الحجلى", "نزله هويمل (بئر جابر)", "نعضة القويعيه", 
    "هباء", "هبت", "هدبان", "هرمة", "هيثم", "وادى الابطن", "وادى الجزل", "وادى الجى (بئر عاطي)", "وادى الرحبه", 
    "وادى السداره", "وادى الشامي", "وادى العشي (العش)", "وادى العين", "وادى الغرس", "وادى برمه", "وادى بيضان", 
    "وادى حـصنـة", "وادى حويره", "وادى طليح", "وادى عرفه", "وادى قرم", "وادى كبر", "وادى هدمه", "وادي الفرع", 
    "وادي العطشان", "وادي الفرع - الرميده", "وادي الفرع - السليم", "وادي الفرع - المسبعة", "وادي الفرع - اليسيره", 
    "وادي الفرع - غراب", "وادي النقيع", "وادي خضلة", "وادي محلف", "واسمه", "واقصه", "وتر", "وجده", "وجري", "وجه", 
    "وديه", "وريثان", "وقير", "يدعه الوطيه", "يمينه", "ينبع", "ينبع البحر - السليم", "ينبع البحر - الشهيباء", 
    "ينبع البحر - الصمد", "ينبع البحر - اللحيان", "ينبع البحر - المشيريف", "ينبع البحر - المصلى", "ينبع البحر - المعيزله", 
    "ينبع البحر - النجيل", "ينبع البحر - اليسيره", "ينبع البحر - تناضب", "ينبع البحر - سويقة", "ينبع الصناعيه", 
    "ينبع النخل"
]

cities_8th = [
    "أم جرفان", "أم فارس", "ابا العجاج", "ابار ابا العجاج", "ابار الخلاص", "ابار دبيسى", "ابن غنيم", "ابو الحنشان", 
    "ابو القزاز", "ابو خريطه", "ابو دومه", "ابو راكه", "ابو رمانه", "ابوسلمه", "ابوطينه", "ابيار الرص", 
    "ابيار الزبيره", "ابيط", "احامر", "ارتاما", "ارتواز السعلوه", "ارتواز الشرف محطه الخليج", "ارتواز ام بريره", 
    "ارتواز وادي عفال", "استراحة سليمان العطوي", "اسكان حاله عمار", "اشواق", "الاخضر", "الاسكان الخيري", 
    "الاسيله", "الاشقم", "الاصيفر", "الباطن", "البدع - البدع", "البديع", "البديعات", "البديعه", "البغث", 
    "البليطيح", "البوانه", "البويطن", "البييره", "الجبعاوية", "الجبعاوية (جريش)", "الجحر", "الجم", 
    "الجهراء القديمه", "الجو", "الحائل", "الحايل الأعلى", "الحجره", "الحرة الشماليه", "الحزم", "الحسى", 
    "الحشيه", "الحفير(العقيربان)", "الحفيره", "الحمض", "الحوي", "الخرار", "الخريبه", "الخريم", "الخزان", 
    "الخشارم", "الخقوق مع فرقة صيانة طرق", "الخلخول", "الخميله", "الخنتقى", "الدره", "الدقم", "الديسه", 
    "الذييل", "الراشده", "الرس", "الرضيم", "الرقم", "الرمضه", "الرويضات", "الزاويه", "الزيته", 
    "السبيل والحميراء", "السجده", "السدره", "السديد", "السرو", "السطيح", "السعلوه", "السمح", "السنانيات", 
    "السهله", "السييله", "الشايب", "الشبحه", "الشبعان", "الشبيكه", "الشتات", "الشدخ", "الشظوه", "الصبيخه", 
    "الصحفه", "الصره الشرقيه والغربيه", "الصفيراء", "الصميدات", "الصميده", "الصوره", "الضرس", "الضلفه", 
    "الطلعه", "الظلعه الشماليه", "العدفه", "العرجاء", "العريفات", "العسافيه", "العصيليه", "العلا - الشهيباء", 
    "العلا - الفارعه", "العلا - حريمل", "العلا - غراب", "العمود", "العنبجه", "العنبه", "العنيق", "العويند", 
    "العين", "العيينه", "الغال", "الغصن", "الفريشمان", "القرص", "القرصه", "القليب", "القليبه", "القواق", 
    "القوه", "القويع", "الكتيب", "الكر", "اللحى", "المائيين", "الماره", "المتاهه", "المثلث طريق الجوف", 
    "المحاش", "المحجر ومزارعه", "المخاظه", "المدقه بئر ثفه", "المذنب (سليع)", "المطيوى", "المعرص", 
    "المعروقه", "المعظم", "المعلق", "المعو", "المقرح", "الملحه", "المليقه", "المنجور", "المويلح", "النابع", 
    "النجل", "النجيل", "النخيره", "النشيفه", "النصبه", "النعيله", "الهدره", "الهضبه ام عصا", "الهميجة (الديسه)", 
    "الهوج", "الوادي الجديد", "الواسطه", "الوجه", "الوجه - الجرف", "الوجه - بئر عوده", "الورقية", "اليمامة", 
    "ام الحيران", "ام الرقاع", "ام السينات", "ام حليفيات", "ام حمضه", "ام رتب (سيح العقيبيه)", "ام سدره", 
    "ام سلمه", "ام ضباع", "ام طرفاه", "ام غواشي", "ام قف", "ام مرايغ", "ام نتش", "امارة منطقة تبوك - البدع", 
    "امارة منطقة تبوك - النويبعه", "املج", "املج - المشيريف", "املج - النويبعه", "املج - بئر عوده", "املج - سمر", 
    "انقد", "اوان", "بئر ابو محيثلات", "بئر الجنينه", "بئر الدثنه", "بئر القبه", "بئر بحار", "بئر بن هرماس", 
    "بئر حامد", "بئر حمدان", "بئر حمدان النمس", "بئر سلامه سلمان", "بئر عايد", "بئر فهي", "بئر مسعود", 
    "بئر معوض", "بئر هذيل", "بئر وادى المياه", "بئرالقصير", "بجده", "بداء", "بهمان", "بواء", "بيار الأخضر", 
    "بير ابودومه", "بيرالبركه", "بيض", "تبوك", "تربان", "توله", "تيماء", "ثال", "ثميم", "حاره الشيخ صبيح", 
    "حاله عمار", "حجج", "حراض", "حرامل", "حضر", "حقل", "حقيل", "حميط", "حنيق", "حيران", "خرباء", 
    "خشم الظبيبه", "دمج", "دواجن استرا", "ذات الحاج", "ذرفي", "رأس الخريطة", "راكان", "رايه", "رجوم الطيارة", 
    "رحى الشمالية", "رحيب", "روافه", "روى", "ريمه", "سباق الهجن", "سحبان", "سحوب", "سد الميس", "سمر", 
    "سمينه", "شركة الردادي للسليكا", "شركة الزاهد للسليكا", "شركة المربعي للسليكا", "شركه تبوك للتنميه الزراعيه تادكو", 
    "شركه كهرباء حاله عمار", "شرماء", "شريف معطيه", "شطين", "شغب", "شقرى الجديده", "شقرى القديمه", "صخين", 
    "صدر", "صدير", "صر", "صروم", "صيخان", "ضباء", "عاقر الحصان", "عرده", "عرقين", "علقان", "علو القصير", 
    "عليان", "عمق", "عنتر", "عين الأخضر", "عينونه", "غر", "غريبين", "غمره", "غميره", "فجر", "فرقة صيانة طرق", 
    "فشيغ", "فم رويث", "فم شثاث", "قاره الحيران", "قامره", "قبقاب", "قراقر", "قرية الجديد", "قرية المثلث", 
    "قصر دحيلان", "قصر عليثه", "قلعه الازنم", "قليب مفلح", "قنا", "قيال", "قيال الغربي وحرس حدود", "كثان", 
    "كسارة سلمان العمري", "كسارة ناصر الفرج", "لصيفان", "ليلى", "مثلث شواق", "مجيرمه", "مجيهيله", "محطة الابيض", 
    "محطة المسيريح", "محطة بن سويه", "مدان", "مدسوس", "مديسيس", "مرخ", "مرس", "مركز حرس حرامل", "مزارع البيضاء", 
    "مزارع الركيه", "مزارع السنانيات", "مزارع الفقير", "مزارع بن رشدان", "مزارع بوهان", "مزارع جريداء", 
    "مزارع جنوب طريق المدينه (الاولى)", "مزارع سمنه", "مزارع شرق طريق حالة عمار", "مزارع شمال تيماء (جريش)", 
    "مزارع شمال شرق تيماء", "مزارع شمال طريق المدينه(الرابعة)", "مزارع فقيه والمزارع المجاوره", "مزارع محجه", 
    "مزرعة حسين بن خضر", "مزرعة سلامه", "مزرعة فريج بن سليمان", "مزرعة هويمل", "مشاش حماطه", "مشاش خشيرمه", 
    "مشاش كديه", "مصروره", "مطار نيوم", "معيدي", "مغيره النشيفه", "مغيرى الطبيق", "مقنا", "مكرى", "ملح", 
    "مورد الشيخ (ابن شهبي)", "نابع داما", "نخل المعرش", "نعضه", "نعمى", "هجرة ام عويقيله", "هداج", 
    "وادى النخيبير", "وادى اميغر", "وادى سلمي", "وادي ضمر"
]

cities_10th = [
    "الزيد", "الفجه", "الشامة", "ضبع", "لافي السحلي", "آبارعوض", "أبو رضام", "أعيوج", "أم أرطى", "أم عرنه", 
    "أم مرقاتين", "ابا الحيران", "ابا الصبان", "ابار طفحان", "ابار وسمه", "ابضه", "ابله", "ابو حميده", 
    "ابو دويحات", "ابو رضام", "ابو رغلات", "ابو ريه", "ابو زريبه", "ابو سهيلات", "ابو سواسي", "ابو سويسيات", 
    "ابو شويحات", "ابو صور", "ابو مزحامه", "ابوزرايب", "ابيره والعريده والرعيله", "احيمرات الجبا", "ارطاوى", 
    "ارطيان", "ارينبات", "اسبطر", "اشبيريه الحمراء", "اشبيريه الصفراء", "اشهب الدميثا", "اشيقر", "اعشيره", 
    "افيعيا", "اكبره", "ال طلوحه", "الأرطاوية", "الأسيمر", "الابرق", "الابيتر", "الاجفر", "الاخضر", 
    "الارشاويه", "الاسمره", "الاشقر", "الاشهب", "الاصابع والرزه", "الباحه", "البتيراء", "البحره", "البدراني", 
    "البدع", "البدنه", "البردان", "البرديه", "البرقه", "البصر", "البطين", "البعايث", "البلازيه", "البنانه", 
    "البوبهيه", "البويب", "البويطن", "البوييضه", "البياضه", "البياضي", "البير", "التايع", "التربيه", 
    "التفيهى نايلات", "التيم", "الثعيلبي", "الثمامى", "الثماميه", "الجابرية", "الجبريه", "الجبيلي (المكمن)", 
    "الجثاميه", "الجثياثه", "الجحريه", "الجحفه", "الجرباء", "الجرعاء", "الجرفية", "الجريه", "الجعراء", 
    "الجفاليه", "الجفر", "الجفره", "الجلف", "الحائط", "الحائط - ارينبه", "الحائط - الابيتر", "الحائط - الروضه", 
    "الحائط - الصفراء", "الحائط - العقيله", "الحائط - المحفر", "الحائط - المرموثه", "الحائط - الوسيطاء", 
    "الحائط - مديسيس", "الحارات الثلاث", "الحارة الثالثة", "الحارة الشمالية", "الحامريه", "الحريرة", "الحزم", 
    "الحزوم", "الحسو", "الحطى", "الحفن", "الحفنه", "الحفير", "الحليفه", "الحليفه السفلى", "الحليفه العليا", 
    "الحليله", "الحماد", "الحماده", "الحمادية", "الحموديه", "الحميداني", "الحميراء", "الحميمه", "الحناتين", 
    "الحنيه", "الحواء", "الحواره", "الحوراء", "الحوصه", "الحويض", "الحويط", "الحيانية", "الخبه", "الخرماء", 
    "الخريزة", "الخشبي", "الخضاب", "الخطه", "الخطه الشرقيه", "الخفج", "الخفيج", "الخلصه", "الخليقه", 
    "الخنقة", "الخنقه الرماحي", "الخوه", "الخوى", "الخوير", "الدابيه", "الداره", "الدحوه", "الدحيلانيات مشاش الدحيلات شرق تربه", 
    "الدغيبجه", "الدفاين", "الدفينة", "الدهيماء", "الدوادمى", "الدويه", "الديماسه", "الذكرى", "الذييبى والسريحه", 
    "الراحه", "الرايغه", "الرخيصيه", "الردهة", "الرديفه", "الرديهة", "الرديهه", "الرس", "الرضامية", "الرضفين", 
    "الرفايع", "الرفيعة", "الرقب", "الرقيطاء", "الركيه", "الروض", "الريمية", "الزبنيه", "الزبيره", "الزغيبيه", 
    "الساقيه", "السبعان", "السحل", "السعيره", "السفن", "السليل", "السليمي", "السليمي - البركه", "السليمي - الصفراء", 
    "السليمي - المرموثه", "السليمي - الوسيطاء", "السليمي - مشرفه", "السناف", "السهلة الحمراء", "السوق الشعبي", 
    "السويعدى", "السويق", "السيافية", "السيايل", "السيح", "الشارف", "الشبالا", "الشبيكه", "الشرثه", "الشرماء", 
    "الشريم", "الشريهيه", "الشطيب", "الشعفه", "الشعلانيه", "الشعيلا", "الشغوة", "الشغوة (2)", "الشغوه", 
    "الشفلحيه", "الشق", "الشقران", "الشقه", "الشقيق", "الشلالة", "الشملى", "الشملي - مبرز", "الشملي - مشرفه", 
    "الشنان", "الشنان - الابيتر", "الشنان - الصفراء", "الشنان - المبادع", "الشنان - مبرز", "الشهبان", "الشهيبه", 
    "الشويلعيه", "الشويمس", "الشيحيه", "الصالحيه", "الصبيحيه", "الصخنه", "الصخيره الجنوبيه", "الصخيره الشمالية", 
    "الصداة", "الصداعيه", "الصغوى", "الصفران", "الصفياء", "الصفيرا", "الصلعاء", "الصليعاء", "الصنينا", 
    "الصهوه", "الصور نادر", "الصيهد", "الضاحيه", "الضبيب", "الضحايا", "الضرب", "الضربه", "الضرس", "الضرسى", 
    "الضلضل", "الضوي", "الطرفاوى", "الطـليحات", "الطنيب", "الطوال", "الطولاء", "الظبية", "الظهر", "العاذرية", 
    "العاند", "العبارثة", "العبلة", "العجاجة", "العدوه", "العراديه", "العرفاء", "العرفجيه- بن بطر -", "العريدة", 
    "العرين", "العريّدة", "العسافية", "العسافيه", "العش", "العطيفيه", "العظيم", "العفنان", "العقيله", 
    "العكيفيه", "العلب", "العليا", "العلياء", "العليم", "العمارة", "العمارية", "العماير", "العميرية", 
    "العنبرية", "العهين", "العوالي", "العوجا", "العوشزى", "العوشزيه", "العويد", "العيثمه", "الغانميه", 
    "الغريبين", "الغريسة الغربية", "الغريسه", "الغريض", "الغزالة - ارينبه", "الغزالة - الجديده", "الغزالة - الروضه", 
    "الغزالة - السعده", "الغزالة - الغزاله", "الغزالة - المبادع", "الغضيات", "الغفيليه", "الغلفا", "الغمياء", 
    "الغميساء", "الفرحانيه", "الفرشه", "الفريهيديه", "الفقي", "الفويلق رقم 1", "الفويلق رقم 2", "القاسميه", 
    "القاعد", "القاعيه", "القحصيه", "القدهي", "القراره", "القرون", "القرينين", "القسمه", "القصر", "القصعه", 
    "القصير", "القصير القديم", "القصير بن متروك", "القصيصه والقصة", "القصيفان القصيفه", "القطعاء", "القعساء", 
    "القفيعى", "القليب ( البنتان)", "القليبة", "القليبين", "القهد", "القويعيه", "القوينيه", "القيعان", 
    "الكرشافة", "الكرشافه", "الكسر", "الكهفه", "الكهيفيه", "اللبانه", "اللجاة", "اللخين عبيد", "اللغفيه", 
    "اللقيطه", "اللويبدة", "اللويش", "المالحة", "المالحه", "المبرز", "المبعوثه", "المبيدع", "المثلث", 
    "المثواه القديمة", "المجصه", "المجيصه", "المحاش", "المحجره", "المحمى ريع المحمي", "المحنا", "المحناء", 
    "المحير", "المختلف", "المخروق", "المخروقه", "المخططات الشرقيه", "المديسيس", "المركوز", "المرمى", 
    "المرورات", "المرير", "المزكا", "المزيريرات", "المساعدية", "المستجده", "المسجد", "المسلسل", "المشيطيه", 
    "المصع", "المضابيع", "المضبعه", "المضيح", "المطرفيه", "المعاذب", "المعازل", "المعباء", "المعترضه", 
    "المعرش", "المعضب", "المعيقل", "المعيقلات", "المغار", "المغدديه", "المغويات", "المــريــر", "المقارن", 
    "المكحول", "المكظم", "المكــــلاة", "الملاح", "الملوى", "المليح", "المناخ", "المنجوري", "المندسه الشرقيه", 
    "المنصورية", "المهاش", "المهينيه", "المويكر", "المياه", "النابيه", "الناصريه", "الناصفة", "الناصفه", 
    "النباء", "النجيل", "النحيتيه", "النظيم", "النظيم واللجاوي", "النعى", "النفس", "النماره", "النميره", 
    "النوايف", "النيصيه", "الهديه", "الهرير", "الهمج", "الهمجه", "الهويدى", "الهيلا", "الودى", "الوسعه", 
    "الوسيطا", "الوسيطا (وسيطاء الحسو)", "الوعيلى", "الوهيبيه", "الْبْـرَاكْ", "ام زريبه الشرقيه والغربيه", 
    "ام ارطاه", "ام العمر", "ام القلبان", "ام النصلان", "ام حبل", "ام حبوس", "ام حرامل", "ام حريملات", 
    "ام روشن", "ام زريبه", "ام ساروت", "ام شعاري", "ام شفلح", "ام صور", "ام طرفاء", "ام طريفه", "ام عماير", 
    "ام قويفات", "ام نشاب", "ام هشيم", "امارة منطقة حائل - الجديده", "امارة منطقة حائل - الغزاله", 
    "امارة منطقة حائل - مشرفة", "امشاش الثلابيت", "انبوان", "انياب", "بئر البعجا", "بئر الرفدى", "بئر بن منوه", 
    "بجيله", "بدائع الجرعاء", "بدائع أول", "بدائع اثقب", "بدائع الاجفر", "بدائع البادية", "بدائع البدع", 
    "بدائع البعايث", "بدائع البكر", "بدائع البويب", "بدائع الجبر", "بدائع الحامريه الحامريه", "بدائع الخبراء", 
    "بدائع الراشد", "بدائع الرويضات", "بدائع الساقية", "بدائع السليمى", "بدائع السواويد", "بدائع الشق", 
    "بدائع الصباحه", "بدائع الصفراء", "بدائع الضرب", "بدائع العراديه", "بدائع العش", "بدائع العليا", 
    "بدائع العمير", "بدائع الفقي", "بدائع القسمة", "بدائع المحمى", "بدائع المسمى", "بدائع المضيح", 
    "بدائع المكظم", "بدائع بن شتيوى", "بدائع بن نماء", "بدائع سقف", "بدائع عقلة بن داني", "بدائع عقلة بن داني الشمالية", 
    "بدائع عقلة جديد", "بدائع غسل", "بدائع فايد بن سالم المثواةالجديده", "بدائع قفار", "بدائع قني", 
    "بدائع مراغان", "بدائع مرحب", "بدائع معيلي", "بدائع نقبين", "بدائع هضبة البويب", "بدايع ابضه", 
    "بدايع الدفينة", "بدايع الدهمشيه", "بدايع السبعان", "بدايع الصغوى", "بدايع العظيم", "بدايع العلم", 
    "بدايع القعساء", "بدايع المكحول", "بدايع ام هروج", "بدايع غمره", "بدايع مريفق", "بدع بن حويط", 
    "بدع بن خلف", "بسيطاء", "بطحاوين", "بطيحان", "بعيجان", "بقعاء", "بقعاء - قدر", "بقعاء - وسيط", 
    "بويب البدع", "بويب الشقه", "بير السطيحيه", "بيضاء نثيل", "بيضاء نثيل الجنوبيه", "بيط", "تخاييل", 
    "تربة", "تلعه بجيله", "توارن", "ثرل", "ثعلب", "ثليثوه", "ثمايل الشقران", "ثويليل", "جانين", "جبال العلم", 
    "جبل التوين", "جبل كفنتة", "جبلة", "جبله", "جبه", "جديه", "جرعا عثمان", "جرمه", "جريعاء غنم", "جفيفا", 
    "جلدية", "جليف مشرفه", "جنفاء", "جو", "حائل", "حارة العرادين", "حرة ام نار", "حريد", "حزم العراد", 
    "حفائر العهين", "حفر الرخيص", "حفيرة السبعه", "حفيرة بن سويلم", "حفيره الشقيق", "حقروصين", "حلية الدحول", 
    "حمدان", "حمر الرفيعة", "حمراء القعساء", "حمراء الوبير", "حمض", "حمه", "حميضه", "حنو الشيحية", "حويان", 
    "حيه", "خب المقنع", "خبراء البويب مزارع البويب", "خبراء شمر الشريهه", "خبراء شمر الشيفان", "خفيج بن مخلد", 
    "خنقة قني", "دبسا", "دبى", "دحله الجوازى", "دحله الزبد", "دحوة الضغن", "دريعه", "دغنون", "دفاين الضبا", 
    "دقيه", "دليهان", "ذراف", "ذيبان", "ذيخين", "رجامه", "رحية أم رجوم", "رديفه الاجفر", "رس جبرين", 
    "رفايع غسل", "رك", "رميثان شريثان", "روض بن هادي", "روض الشقيق", "روضة التنهاة", "روضة العياف", 
    "روضة الكرشافة", "روضة مريفق", "روضه البعايث", "روضه الحاجليه", "روضه العبد", "رويع الخبار", "رياض البويب", 
    "رياض جمال", "ريع البكر", "ريع تقريب", "زريب التيم", "زريب جلدية", "ساحوت", "ساهبه ابو رمث", "سبيعه", 
    "سد البار", "سراء", "سرحه جو", "سقف", "سمره", "سميراء", "سميراء - البركه", "سميراء - قدر", "سميراء - مديسيس", 
    "سميراء - مشرفة", "سميراء - وسيط", "سميراء الضباع", "سناف التمياط", "سناف تركي", "سوق ا?ع?ف", "شبيكان", 
    "شركة (المراعي)", "شركة (نادك)", "شركة المراعي - فرع الصغوى", "شركة حائل للتنمية الزراعية (هادكو)", 
    "شركة مشاريع الدواجن ( الخالدية 2 )", "شركه الاعشاب الذهبيه", "شعب القور", "شعيب الصقعاء", "شعيب الضربة", 
    "شعيب القرن", "شعيب المستجده", "شعيب الناصفة", "شعيب جو", "شعيلا المصع", "شقة البويب", "شقة الفيده", 
    "شقران الأصفر", "شلوان", "شوط", "صحى", "صداء", "صفاق", "صفيان", "صفيط", "صور المقوعى", "ضاحية الشملي الغربية", 
    "ضبيعه", "ضرغط", "ضروه شويمس", "ضريغط", "ضليع الرفدى", "ضليع الصوان", "طابه", "طلحاء", "طلقه", "طلوح", 
    "طويه", "طيارات (مخطط بن عشيش)", "ظفرة", "عثمر المخطط", "عثمر القديم", "عدوه اثقب", "عرنه ابالجرفان", 
    "عريجاء", "عصماء", "عقده", "عقلة أبو نعضات", "عقلة اثقب", "عقلة اللبن", "عقلة مشعان", "عقله المخروق", 
    "عقله الهضب", "عقله بن جبرين", "عقله بن دانى", "عقله بن طواله", "عقيلة اثقب", "عقيلة المسام", "علقة", 
    "عمائر المرير", "عمائر بن صنعاء", "عماير العلم", "عناب الخاصرة", "عويشز", "عيال عبيد", "عيال عبيد- الحارة الثانية", 
    "عين بلطه", "غار بن ناحل", "غزلانه", "غسل", "غمره", "غنيم", "فتخا", "فرشة نجب", "فرشه الشقيق", "فرشه الكان", 
    "فياض الحامريه", "فياض النعام", "فيد", "فيضة السمار", "فيضة الطوال", "فيضة المسعار", "فيضة الهمج", 
    "فيضة بن سويلم", "فيضه اثقب", "فيضه الاشهب", "فيضه العبل", "فيضه العلم", "قاع الهلالى", "قاع حجلاء", 
    "قرية بير الشقراء", "قريه السالمية", "قريه اللخين", "قريه ام نخله", "قريه سعيدان", "قسمه الرقب", 
    "قسمه بن فضلون", "قصر العشروات", "قصيباء", "قصير شامان", "قصيريات", "قفار", "قليب الاطرم", "قليب الشلقان", 
    "قليب ذياب", "قمران", "قنا", "قهوة و محطة واستراحة الفيصل", "كتيفه", "كحله", "كرانيف", "كليخان", 
    "كمب ابن براك", "كمب الثنيان", "كمب الضلوع", "لبده", "لحاء", "مباري", "مجمع كسارات منطقة حائل", 
    "مجمع وادي الرمة", "محطه رخام", "محيذيفة", "محير الميركه", "محير ذويره", "محير غنيم", "مخطط ( شفا البين ) السكني", 
    "مخطط (600)", "مخطط الدهيثم", "مخطط الشفاء", "مخطط الشفاء(2)", "مخطط الكتاديات", "مخطط الهباج", 
    "مخطط ام القلبان", "مخطط ام عمائر", "مخطط بن سويلم", "مخطط رقم(320) وَ مخطط رقم(7867)", "مخطط روضه الطليحه", 
    "مخطط محمد الحبيب الزراعي", "مديسيس", "مراغان الجديد", "مراغان القديم", "مران", "مرجع الروض", "مرحب", 
    "مرحب العليا", "مرفيه", "مريحات", "مريغان", "مريفق", "مزارع أشبرية الحمراء", "مزارع ابو غيل", 
    "مزارع الأسيمر", "مزارع الحدبه", "مزارع الخاصرة", "مزارع الصلبيه الشماليه", "مزارع العهيل الشضيفات", 
    "مزارع الوبريات", "مزارع جلدية", "مزارع حبشي", "مزارع شرى الجنوبيه", "مزارع عقلة بن طواله", 
    "مزارع قديرة شعيب غسل", "مزارع مروي", "مزرعة ماطر ابراهيم المرعيد بالبعجاء", "مزعله", "مشاش بن جازي", 
    "مشاش الحمادة", "مشاش الطرفا", "مشاش جاوان", "مشاش ريحان", "مشروع الجبرين", "مشروع القطار", 
    "مصنع اسمنت حائل", "مصنع البلك", "مطلق", "مقارن النعيمه", "مقناة الردود", "ملحا", "منجم الزبيرة", 
    "منيفة القاعد", "مواقع تعدينية خاصة بــ(السيليكا)", "موقع تدريب الأمن العام", "موقع تدريب الدفاع المدني", 
    "موقق", "موقق - السعده", "موقق - العقيله", "موقق - المحفر", "نخله", "نعيمين", "نقذه", "نقره قفار", 
    "هجرة الخمشه", "هجرة الرفدي", "هجرة السرة", "هجرة المخروق", "هجره القعقاع", "هجره اللبيدى", "هجره فرتاج", 
    "هضاب جلنفوة", "وادي البعيثة", "وادي الضربة", "وتده", "ودي الحزم الودي", "وسعة الرس", "وسعة ام قذلة", 
    "وسيط الشعيبات", "وسيطا الحفن", "وسيطاء البدع", "وسيطاء الفقي", "وسيطاء علي", "وسيطاء غسل"
]

cities_13th= [
    "ابا الحرجان", "ابا الرشاش", "ابا السلع طلحام وبني عكس", "ابا القير", "اباالرخم وسط", "اباالنخل", 
    "ابرق شرقه", "ابو رجلين", "ابو شداد", "اثب", "ارتاد", "اشقاب", "ال ربيع", "الابرق", "الابرقيه", 
    "الاخاشيم", "الادغم (الصليعاء)", "الارجاه", "الاقرح", "الاقور", "البتراء", "البحره", "البياض", 
    "الثرماله", "الثعيلبه", "الجبله الوسطى", "الجديده", "الجراز", "الجربه", "الجعب", "الجفجف", 
    "الجفره", "الجفه", "الجنفور", "الجهوش", "الجوشن", "الجوف", "الحاجب الحمر", "الحاضنه", "الحايرة", 
    "الحبابه", "الحبشيه", "الحجف", "الحجمه", "الحدباء", "الحرشاء", "الحرشف", "الحزقاء", "الحزمه", 
    "الحصينية", "الحضن الاصفر", "الحضيره", "الحقو قدقده", "الحقي", "الحلقوم", "الحماد", "الحموم", 
    "الحنكان", "الخالديه", "الخرخير", "الخرماء", "الخشوب", "الخضراء", "الخضراء الوسطى", "الخضره", 
    "الخطوه", "الخنق", "الدريعاء", "الدمنه", "الدوكر", "الرابيه", "الرحاب", "الرحبه", "الرغيب", 
    "الرفزه", "الرفغه", "الرفيعه", "الروضه", "الرون", "الزمله", "السامك", "السبيل", "السربه", 
    "السريحه", "السطحية", "السقامه", "السلف", "السليمه", "السواد", "السوايل", "السويداء", 
    "السويده", "السيافية", "الشبكه", "الشدقاء", "الشط", "الشط", "الشعب", "الصفاح", 
    "الصفران (الروساء)", "الصفق", "الصماء", "الصمع", "الصناعيه الجديده", "الضبط", "الضيقه", 
    "الضيقه", "الطوى", "الظاهره", "الظفره", "العباله", "العرج", "العرف", "العرقان", "العرقين", 
    "العرقين", "العشه", "العطف", "العميريه", "العوافي", "العين والقرين", "الغثمه", "الغميس (الغمبيس)", 
    "الغييظه", "الفرحه", "الفطحه", "القافيه", "القايمه", "القرن", "الكسارات", "الكوكب", "اللحمتين", 
    "اللقطه", "المجزعه", "المجمع", "المحمديه", "المحياش", "المختلف", "المخمره", "المدره (المداره)", 
    "المذنب", "المرتجم", "المرخ", "المرطاء", "المرقب", "المريفق", "المسيفير", "المشراق", "المشعليه", 
    "المشقح", "المشنه", "المصانع الكبرى للتعدين (اماك)", "المصداره (الصالحيه)", "المعاطيف", 
    "المعيقل", "المغوى", "الملاحه (المملح)", "الملح", "المليحه", "المنتزه", "المنتشر", "المنخلي", 
    "المندفن", "المنسرقه", "المنصلخه", "النبعه", "النضاره", "النظيم", "النقحه", "النقعاء", 
    "النقيحاء", "النقيحاء مورد", "النمصه", "النهوم", "النوش", "الواتد", "الوجيد", "الوحشه (المصراخ)", 
    "الوديعه", "الوهاب", "الوهلان", "ام الحوض", "ام الزهر (زهره)", "ام العرقين", "ام الملح", 
    "ام الوهط", "ام غارب", "اوطيده", "بئر ال زبيره (الزباره)", "بئر الجوف", "بئر الصاله", 
    "بئر العضبات", "بئر المبعوث (ابار المبعوث)", "بئر بن فيحان بئر بن ذيبان", "بئر بن لادن", 
    "بئر شايق العضبه", "بئر عسكر", "بئر عكذباء", "بادية الرغام", "باديه ذى حباب", "باديه ساره", 
    "بدر الجنوب", "برقا اعاره", "بصر", "بظا", "بني ثرار", "بني حدد", "بني حواره", "بني حويه", 
    "بني راه", "بني عباره", "بني عهين", "بني قارض", "بني مثيب", "بهجه", "بير العطف", "تريمه", 
    "تلاع", "تماني", "ثار", "ثار - الرحبه", "ثجر", "جبل الطائرة", "جفره سعد", "حبونا", 
    "حشوه الفيض", "حمراء نثيل", "حمى", "حميران", "خباش", "خشم العان", "خضيران", "خيره", "دوح", 
    "ذات الضب", "ذات المزن", "ذبوب", "ذنبه", "راسان", "رضيه غوبر", "رغوان", "رهوه نصب", "زهقه", 
    "زور الاثله", "زور العقارب", "سائلة غزال", "سادة والشن", "سحامه", "سحامه", "سرداب", "سلطانه", 
    "سلف مشعل الخضراء", "سلوه", "سواس", "شروره", "شصره", "شقه الكناور", "شكلاله", "شواحط", 
    "صخاء", "صخى", "صدعه", "صله", "صناخه", "طليله", "عاكفه المعاين", "عبالم", "عرفطه", 
    "عرق الشارعه", "عرق فليح", "عشاره", "عشر", "عشه الاجرف", "عشه الرخم", "عشه الساره (ساره)", 
    "علفوت", "علو السواد", "عنص", "عويل", "عيان", "غاب", "غثيمه هجره قانيه", "غرمله", "فجيح", 
    "فرع الجبل", "قبور الدوله", "قدس", "قرضه الحق", "قرى", "قلمه البتراء", "قلمه خجيم", "كتان", 
    "كحيل", "كريثه", "كمب بن لادن", "كهرباء شروره وشركة تعليم القياده", "كهلان", "لبو", "لحيفه", 
    "لدمه", "لزم", "لصيفا", "مجه", "محطة فهد عبد الله العرجاني", "محطه وقود عرق السيول", 
    "محير حصين", "مزارع الحصينية للدواجن", "مزارع دواجن الحلاه", "مزارع وادي حبونا الجنوبية", 
    "مصنع اسمنت نجران", "مطاره", "معمر الصمصام", "مفرق عاكفه (الشطيبه)", "منادي", "منجم المصانع", 
    "منفذ الوديعه", "منقذه", "موعاه", "نجد الحصان", "نجد المملح غراء", "نجد سهى", "نجد لجعه", 
    "نجد معين", "نجران", "نزغه", "نسر (آبار حمى الأثرية)", "نعمان", "نعوان", "نقعاء حتروش", 
    "نقعاء منيع ابا الطحين", "نهماء", "هجر طلحام", "هجر نجد النشم", "هجر وادي الحبط العزيزيه", 
    "هجر وادي القرى", "هجره الرفاع", "هجره النميص", "هويمل", "وادي اوال", "وادي يعرف", "وشيل الذيب", 
    "يتم", "يدمه"
]








# Define the lists for dropdowns
license_type = [
    "رخصة فال للوساطة العقارية والتسويق",
    "رخصة فال لإدارة المرافق",
    "رخصة فال لإدارة العقارات",
    "رخصة فال لمزادات العقارات",
    "رخصة فال للاستشارات العقارية",
    "رخصة فال لتحليلات العقارات"
]

dealer_type = [
    "وسيط مؤسسي",
    "وسيط فردي"
]

regions = [
    "المنطقة الشرقية",
    "منطقة الباحة",
    "منطقة الجوف",
    "منطقة الحدود الشمالية",
    "منطقة الرياض",
    "منطقة القصيم",
    "منطقة المدينة المنورة",
    "منطقة تبوك",
    "منطقة جازان",
    "منطقة حائل",
    "منطقة عسير",
    "منطقة مكة المكرمة",
    "منطقة نجران"
]




# Mapping regions to corresponding cities (simplified for example)
region_to_cities = {
    "المنطقة الشرقية": cities_1st,
    "منطقة الباحة": cities_2nd,
    "منطقة الجوف": cities_3rd,
    "منطقة الحدود الشمالية": cities_4th,
    "منطقة الرياض": cities_5th,
    "منطقة القصيم": cities_6th,
    "منطقة المدينة المنورة": cities_7th,
    "منطقة تبوك": cities_8th,
    "منطقة جازان": cities_1st,
    "منطقة حائل": cities_10th,
    "منطقة عسير": cities_1st,
    "منطقة مكة المكرمة": cities_1st,
    "منطقة نجران": cities_13th
}

class LicenseScraperApp:
    def __init__(self, root):
        self.root = root
        self.root.title('نظام الرخص العقارية')
        self.root.geometry("800x800")  # Larger window size
        self.root.configure(bg='#f0f0f0')  # Light background

        # Custom font
        self.custom_font = ('Arial', 14)

        # Header Frame
        self.header_frame = tk.Frame(root, bg='#006c35', height=80)
        self.header_frame.pack(fill=tk.X)

        # Header Label
        self.header_label = tk.Label(
            self.header_frame,
            text="Real estate dealers scraper bot",
            font=('Arial', 24, 'bold'),
            fg='white',
            bg='#006c35'
        )
        self.header_label.pack(pady=20)

        # Main Content Frame
        self.main_frame = tk.Frame(root, bg='#f0f0f0')
        self.main_frame.pack(pady=20, padx=20, fill=tk.BOTH, expand=True)

        # License Type
        self.license_label = tk.Label(
            self.main_frame,
            text="اختر نوع الرخصة:",
            font=self.custom_font,
            fg='#333333',
            bg='#f0f0f0'
        )
        self.license_label.pack(pady=10)

        self.license_combo = ttk.Combobox(
            self.main_frame,
            values=license_type,
            font=self.custom_font,
            state="readonly"
        )
        self.license_combo.pack(pady=10, ipadx=10, ipady=5)

        # Dealer Type
        self.dealer_label = tk.Label(
            self.main_frame,
            text="اختر نوع الوسيط:",
            font=self.custom_font,
            fg='#333333',
            bg='#f0f0f0'
        )
        self.dealer_label.pack(pady=10)

        self.dealer_combo = ttk.Combobox(
            self.main_frame,
            values=dealer_type,
            font=self.custom_font,
            state="readonly"
        )
        self.dealer_combo.pack(pady=10, ipadx=10, ipady=5)

        # Region
        self.region_label = tk.Label(
            self.main_frame,
            text="اختر المنطقة:",
            font=self.custom_font,
            fg='#333333',
            bg='#f0f0f0'
        )
        self.region_label.pack(pady=10)

        self.region_combo = ttk.Combobox(
            self.main_frame,
            values=regions,
            font=self.custom_font,
            state="readonly"
        )
        self.region_combo.pack(pady=10, ipadx=10, ipady=5)
        self.region_combo.bind("<<ComboboxSelected>>", self.update_city_options)

        # City
        self.city_label = tk.Label(
            self.main_frame,
            text="اختر المدينة:",
            font=self.custom_font,
            fg='#333333',
            bg='#f0f0f0'
        )
        self.city_label.pack(pady=10)

        self.city_combo = ttk.Combobox(
            self.main_frame,
            font=self.custom_font,
            state="readonly"
        )
        self.city_combo.pack(pady=10, ipadx=10, ipady=5)

        # Go Button
        self.go_button = tk.Button(
            self.main_frame,
            text="ابدأ",
            command=self.on_go_button_click,
            font=self.custom_font,
            bg='#006c35',
            fg='white',
            padx=20,
            pady=10,
            bd=0,
            activebackground='#45a049',
            activeforeground='white'
        )
        self.go_button.pack(pady=30)

    def update_city_options(self, event):
        selected_region = self.region_combo.get()
        if selected_region in region_to_cities:
            self.city_combo['values'] = region_to_cities[selected_region]
            self.city_combo.set('')  # Clear city selection

    def on_go_button_click(self):
        selected_license = self.license_combo.get()
        selected_dealer = self.dealer_combo.get()
        selected_region = self.region_combo.get()
        selected_city = self.city_combo.get()

        # Save user choices to a dictionary
        user_choices = {
            "license_type": selected_license,
            "dealer_type": selected_dealer,
            "region": selected_region,
            "city": selected_city
        }

        # Save the dictionary to a JSON file
        with open('user_choices.json', 'w', encoding='utf-8') as f:
            json.dump(user_choices, f, ensure_ascii=False, indent=4)



        # Show success message
        success_label = tk.Label(
            self.main_frame,
            text="تم الحفظ بنجاح!",
            font=self.custom_font,
            fg='green',
            bg='#f0f0f0'
        )
        success_label.pack(pady=10)




# If this script is run directly, create the app window
if __name__ == "__main__": 
    root = tk.Tk()
    app = LicenseScraperApp(root)
    root.mainloop()

# Read the selectors from the JSON file in the Drission part of the code


        # CSS Selectors (user options)
LICENSE_TYPE_DROPDOWN = '#__next > div:nth-child(2) > div.main-content > div > div > div.MainCard_mainCard__L9tmE > div > div.MuiBox-root.css-0 > form > div > div.block-from-group.four-col > div:nth-child(1) > div.sc-epPVmt.bkPfkn.dgaui.dgaui_dropdown > div.sc-fpSrms.jwLulP.dgaui_dropdownContainer > div.placeholder'
DEALER_TYPE_DROPDOWN = '#__next > div:nth-child(2) > div.main-content > div > div > div.MainCard_mainCard__L9tmE > div > div.MuiBox-root.css-0 > form > div > div.block-from-group.four-col > div:nth-child(2) > div.sc-epPVmt.bkPfkn.dgaui.dgaui_dropdown > div.sc-fpSrms.jwLulP.dgaui_dropdownContainer > div.placeholder'
CITY_DROPDOWN=f'#__next > div:nth-child(2) > div.main-content > div > div > div.MainCard_mainCard__L9tmE > div > div.MuiBox-root.css-0 > form > div > div.block-from-group.four-col > div:nth-child(5) > div.sc-fQpRED.dCdkjN.dgaui.dgaui_autocomplete > div.sc-dsLQwm.kPRipq.dgaui_dropdownContainer > input'
#AREA_DROPDOWN=f''
#AREA_OPTION=f''
STATE_DROPDOWN = '#__next > div:nth-child(2) > div.main-content > div > div > div.MainCard_mainCard__L9tmE > div > div.MuiBox-root.css-0 > form > div > div.block-from-group.four-col > div:nth-child(4) > div.sc-epPVmt.bkPfkn.dgaui.dgaui_dropdown > div.sc-fpSrms.jwLulP.dgaui_dropdownContainer > div.placeholder'
SUBMIT_BUTTON = '#__next > div:nth-child(2) > div.main-content > div > div > div.MainCard_mainCard__L9tmE > div > div.MuiBox-root.css-0 > form > div > div.bottomSubmitSection > button'

# Set up Drission
# Set up Drission
co = ChromiumOptions()
#co.set_argument('--headless')
page = ChromiumPage(co)

# Open the target webpage
print("Initializing the bot...")
page.get('https://eservicesredp.rega.gov.sa/auth/queries/Brokerage')
print("Choosing search filters...")

time.sleep(2)        
# Read the user choices from the JSON file
with open('user_choices.json', 'r', encoding='utf-8') as f:
    user_choices = json.load(f)

# Map user choices to their respective indices in the dropdowns
license_type_index = license_type.index(user_choices['license_type']) + 1
dealer_type_index = dealer_type.index(user_choices['dealer_type']) + 1
region_index = regions.index(user_choices['region']) + 1
city_index = region_to_cities[user_choices['region']].index(user_choices['city']) + 1





time.sleep(2)
#Filters

# Filters
# LICENSE TYPE
page.ele('css:' + LICENSE_TYPE_DROPDOWN).click()
page.ele(f'css:#__next > div:nth-child(2) > div.main-content > div > div > div.MainCard_mainCard__L9tmE > div > div.MuiBox-root.css-0 > form > div > div.block-from-group.four-col > div:nth-child(1) > div.sc-epPVmt.bkPfkn.dgaui.dgaui_dropdown > div.dgaui_dropdownItems.slide-bottom > div:nth-child({license_type_index})').click()

# DEALER TYPE
page.ele('css:' + DEALER_TYPE_DROPDOWN).click()
page.ele(f'css:#__next > div:nth-child(2) > div.main-content > div > div > div.MainCard_mainCard__L9tmE > div > div.MuiBox-root.css-0 > form > div > div.block-from-group.four-col > div:nth-child(2) > div.sc-epPVmt.bkPfkn.dgaui.dgaui_dropdown > div.dgaui_dropdownItems.slide-bottom > div:nth-child({dealer_type_index})').click()

# REGION
page.ele('css:' + STATE_DROPDOWN).click()
page.ele(f'css:#__next > div:nth-child(2) > div.main-content > div > div > div.MainCard_mainCard__L9tmE > div > div.MuiBox-root.css-0 > form > div > div.block-from-group.four-col > div:nth-child(4) > div.sc-epPVmt.bkPfkn.dgaui.dgaui_dropdown > div.dgaui_dropdownItems.slide-bottom > div:nth-child({region_index})').click()

# CITY
page.ele('css:' + CITY_DROPDOWN).click()
time.sleep(4)
page.ele(f'css:#__next > div:nth-child(2) > div.main-content > div > div > div.MainCard_mainCard__L9tmE > div > div.MuiBox-root.css-0 > form > div > div.block-from-group.four-col > div:nth-child(5) > div.sc-fQpRED.dCdkjN.dgaui.dgaui_autocomplete > div.items.slide-bottom > div:nth-child({city_index})').click()

# CHECK BUTTON
page.ele('css:' + SUBMIT_BUTTON).click()
print('HITTING CHECK BUTTON')
time.sleep(4)
main_start_time = time.time()  # Record start time


for _ in range(5):
    pyautogui.press('pagedown')  
    time.sleep(0.5)  
import math
# Locate the element using Drission's page.ele method
subtitle_element = page.ele('css:#__next > div:nth-child(2) > div.main-content > div > div > div.MainCard_mainCard__L9tmE > div > div:nth-child(3) > div.section-title > span')


text_content = subtitle_element.text.strip()
    
    # Extract only the numeric part
number_str = ''.join(filter(str.isdigit, text_content))
new_number = int(number_str)
    
    # Calculate the number of pages
max_pages = math.ceil(new_number / 10)  # Round up to the nearest integer
    
    # Print the result
print(f"RESULTS: {new_number}")
print(f"PAGES NUMBER: {max_pages}")








# List to store scraped data
scraped_data = []

# Function to process a single element
def process_element(element, element_index):
    start_time = time.time()  # Record start time

    try:
        # Extract the href attribute (link)
        link = element.attr('href')
        if not link:
            print("No link found for the element.")
            return

        print(f"Opening link: {link}")

        # Extract city and neighborhood from the element text
        lines = element.text.split('\n')  # Split text into lines
        city = lines[5] if len(lines) > 5 else "No Data"
        neighborhood = lines[7] if len(lines) > 7 else "No Data"

        # Open link in a new tab
        new_tab = page.new_tab()
        new_tab.get(link)  # Navigate to the link

        time.sleep(5)  # Wait briefly for the page to stabilize

        # Extract data from the .blockForm section
        data = new_tab.run_js(
            """
            const blockForm = document.querySelector('.blockForm');
            if (blockForm) {
                const groupItems = blockForm.querySelectorAll('.groupItemShow');
                const data = {};
                groupItems.forEach(item => {
                    const label = item.querySelector('.lableShow')?.textContent || 'Unknown Label';
                    const dataValue = item.querySelector('.showData')?.textContent || 'No Data';
                    data[label] = dataValue;
                });
                return data;
            } else {
                return null;
            }
            """
        )

        # Add the city and neighborhood data to the scraped data
        data["المدينة"] = city
        data["الحي"] = neighborhood

        # Extract additional data from the .dataForm section
        additional_data = new_tab.run_js(
            """
            const dataForm = document.querySelector('.dataForm.bordered');
            if (dataForm) {
                const groupItems = dataForm.querySelectorAll('.groupItemShow');
                const data = {};
                groupItems.forEach(item => {
                    const label = item.querySelector('.lableShow')?.textContent || 'Unknown Label';
                    const dataValue = item.querySelector('.showData')?.textContent || 'No Data';
                    data[label] = dataValue;
                });
                return data;
            } else {
                return null;
            }
            """
        )

        # Combine all data and add it to the scraped data list
        combined_data = {"Element": f"Element {element_index + 1}", **data}
        if additional_data:
            combined_data.update(additional_data)
        scraped_data.append(combined_data)

        # Close the new tab
        new_tab.close()
        print("Tab closed successfully.")

    except Exception as e:
        print(f"Error processing element: {e}")
    finally:
        end_time = time.time()  # Record end time
        execution_time = end_time - start_time  # Calculate execution time
        print(f"Execution time: {execution_time:.2f} seconds")

# Function to process elements on the current page
def process_current_page():
    
    elements = page.eles('css:a.blockForm.clickable')  # Get all elements
    if elements:
        for i, element in enumerate(elements):
            print(f"Processing element {i + 1}")
            process_element(element, i)
        
    else:
        print('NO ELEMENTS FOUNDED')
        page.close
    
# Start scraping and navigating through pages
for current_page in range(1, max_pages + 1):
    print(f"Processing page {current_page}...")
    time.sleep(5)
    process_current_page()

    # Update 'f' to 7 after 3 pages
    if current_page > 3:
        f = 7
    else:
        f = 6

    # Click the "Next" button to go to the next page
    next_button = page.ele(f'xpath=//*[@id="__next"]/div[2]/div[2]/div/div/div[3]/div/div[3]/div[3]/div/div/button[{f}]')
    if next_button:
        next_button.click()
        time.sleep(3)  # Wait for the next page to load
    else:
        print("No 'Next' button found. Stopping pagination.")
        break


# Define the desired column order
desired_order = [
    "Element",
    "اسم الوسيط",
    "نوع الوسيط",
    "البريد الإلكتروني",
    "رقم الجوال",
    "المدينة",
    "الحي",
    "الرقم الموحد للمنشـأة",
    "نوع الرخصة",
    " رقم الرخصة",
    "حالة الرخصة"
]


# Dynamically extract column names from the scraped data
columns = set()
for item in scraped_data:
    columns.update(item.keys())

# Ensure columns include all from desired_order
columns = [col for col in desired_order if col in columns] + [col for col in columns if col not in desired_order]

# Create a DataFrame from the scraped data
try:
    df = pd.DataFrame(scraped_data)
    # Reorder the columns based on the desired order
    df = df.reindex(columns=desired_order)
except Exception as e:
    print(f"Error creating or reordering DataFrame: {e}")
    print("Scraped data:", scraped_data)
    exit()

# Save the DataFrame to an Excel file
excel_file = "scraped_data.xlsx"
try:
    df.to_excel(excel_file, index=False)
    print(f"Scraped data saved to {excel_file}")
except Exception as e:
    print(f"Error saving Excel file: {e}")
    print("DataFrame content:", df)

main_end_time = time.time()  # Record end time
main_execution_time = main_end_time - main_start_time  # Calculate execution time
print(f"Execution time: {main_execution_time:.2f} seconds")


